

export const ISTJ = {
    title1: 'Описание типа личности:',
    text1: 'Это логически мыслящий и организованный тип личности, \
который знаменит своей ответственностью и сосредоточенностью на деталях. \
Они любят следовать определенным правилам и процедурам и склонны к сохранению статус-кво. \
Ориентированы на достижение целей и практические результаты, \
их работа характеризуется высокой приверженностью и дисциплиной.',

    title2: 'Сильные стороны:',
    text2: 'Надежные и ответственные работники, \
чей труд характеризуется точностью и пунктуальностью. \
Являясь хорошими логиками, они рационально оценивают ситуации, \
избегают рисков и проявляют рациональность при принятии решений',

    title3: "Слабые стороны:",
    text3: "часто слишком пристрастны к следованию правилам, \
что может препятствовать инновациям или решению проблем. \
Иногда они могут быть недостаточно гибкими в обстановках, \
которые требуют быстрого реагирования. \
Также они склонны к подавлению своих эмоций \
и могут не замечать эмоциональных потребностей окружающих.",

    title4: 'Подходящие профессии:',
    text4: 'Наиболее успешны в профессиях, где необходимо высокое качество, \
точность и дисциплина, например, бухгалтеры, юристы, инженеры, \
менеджеры по производству, педагоги, врачи и др.',

    title5: 'Как работать с представителем данного типа личности:',
    text5: '- Не ожидайте от них сильно выразительных эмоций и экспрессии. Они обычно выглядят спокойными и уравновешенными.\n\
- Уважайте их систематичный подход к работе. Они любят, когда задачи структурированы и четко определены.\n\
- Будьте терпеливы при работе с ним, он может быть более медленным, но стабильным работником.',

    title6: 'Как ставить задачи:',
    text6: '- Предоставьте им четкие инструкции и конкретные цели для достижения.\n\
- Дайте возможность работать в медленном темпе, чтобы они могли закончить свою работу тщательно и точно.\n\
- Уделите внимание деталям, они обычно очень внимательны к деталям и отвечают за качество своей работы.',

    title7: 'Чем мотивировать:',
    text7: '- Поощряйте их точность и признавайте их усилия.\n\
- Дайте им возможность работать самостоятельно и контролировать свою работу.\n\
- Используйте систему вознаграждений для стимулирования лучшей работы.',

    title8: 'Как решать проблемы и избегать конфликтов:',
    text8: '- Старайтесь давать четкие инструкции и убедитесь, что они понимают, что от них требуется.\n\
- Будьте аккуратны с критикой, они не любят проявлять слишком много эмоций, и критика может их пугать.\n\
- Избегайте конфликтов, они могут трудно переносить неприятности и стресс.',

    title9: 'Как развивать лидерские способности и управлять командой:',
    text9: '- Они хорошо знают, что им нужно сделать, и наиболее эффективны, когда им дали конкретные задачи. \
Предоставьте им ясные цели и план действий.\n\
- Дайте им возможность вести работу самостоятельно, они не слишком подходят для работы в команде.\n\
- Укажите на структуру и порядок, они обычно ценят планирование и ясность.',
}

export const ISFJ = {
    title1: 'Описание типа личности:',
    text1: 'Это бережный и дружелюбный тип личности, \
который проявляет заботу о своих коллегах и организации. \
Они чувствительны к потребностям других людей \
и склонны к следованию традициям и установленным правилам. \
Могут оказаться бесценным активом для компании благодаря своей надежности и заботливости.',

    title2: 'Сильные стороны:',
    text2: 'Лучшие практические работники, \
надежные и добросовестные. Они сильны в межличностных \
взаимодействиях и заботятся о комфорте окружающих, \
проявляют высокую степень дисциплины и ответственности в своей работе.',

    title3: 'Слабые стороны:',
    text3: 'Им может не хватать уверенности в себе в новых ситуациях, \
они могут слишком привязываться к традициям и прошлому, \
что может препятствовать инновациям. Они могут не проявлять \
достаточное количеством инициативы и креативности.',

    title4: 'Подходящие профессии:',
    text4: 'Имеют отличные навыки в области организации и межличностных отношений, \
поэтому они выгодно проявляют себя в области медицины, \
образования, библиотечных, юридических и административных профессиях.',

    title5: 'Как работать с представителем данного типа личности:',
    text5: '- Старайтесь спокойно общаться с ними и уважать их личное пространство.\n\
- Будьте терпеливы и дайте им достаточно времени, чтобы проявить свои способности.\n\
- Избегайте конфликтов, они не любят конфликты и разногласия.',

    title6: 'Как ставить задачи:',
    text6: '- Давайте очень конкретные и понятные инструкции. Они ценят ясность и четкость.\n\
- Постарайтесь избегать неожиданностей и стараться, чтобы задача и ее результат был заранее определенным.\n\
- Поощряйте и подчеркивайте важность их работы, их любовь к заботе о других людях.',

    title7: 'Чем мотивировать:',
    text7: '- Определите их личные мотивы и желания. Старайтесь быстро найти те способы, которые могут вдохновить их на работу.\n\
- Поощряйте и оценивайте их личный вклад и усилия.\n\
- Помните, что они больше мотивируются комфортным и стабильным окружением.',

    title8: 'Как решать проблемы и избегать конфликтов:',
    text8: '- Будьте деликатны в общении и избегайте конфликтных ситуаций.\n\
- Старайтесь находить решения с помощью логического подхода, которые гарантируют их безопасность и благополучие.\n\
- Будьте терпеливы и внимательны к их взгляду на жизнь, они уникальны и заботливы \
и любят принимать решения, которые вписываются в их систему ценностей.',

    title9: 'Как развивать лидерские способности и управлять командой:',
    text9: '- Склонны к выполнению задач и работе в комманде, однако они не стремятся быть лидерами.\n\
- Наблюдайте и определите их цели и мотивы.\n\
- Предоставьте им возможность заботиться о людях и использовать свои знания в этой области, \
тому что приведет к стабильной производительности в команде.',
}

export const INFJ = {
    title1: 'Описание типа личности:',
    text1: 'Это интуитивный и эмпатичный тип личности, \
который ориентирован на помощь людям и обществу в целом. \
Они обладают необычайной способностью понимать \
и чувствовать потребности других людей и могут подойти для ролей, \
связанных с социальной работой, консультированием, преподаванием и терапией. \
Могут оказаться ценным активом для компании благодаря своей креативности \
и способности к анализу сложных ситуаций.',

    title2: 'Сильные стороны:',
    text2: 'Творческие и интуитивные, \
они могут оказаться инноваторами в своей области. \
Они искренне заботятся о других людях и могут быть великолепными лидерами и наставниками. \
Имеют высокую социальную ответственность \
и обладают уникальной способностью рассматривать проблемы со всех сторон.',

    title3: 'Слабые стороны:',
    text3: 'Им может не хватать уверенности в себе \
и они могут слишком часто сомневаться в своих способностях. \
Они могут страдать из-за перенасыщения эмоций других людей \
и быть недостаточно осторожными в отношении личной границы. \
Иногда могут слишком увлекаться вопросами человеческой психологии, \
что может привести к недостаточному вниманию к коммерческой стороне бизнеса.',

    title4: 'Подходящие профессии:',
    text4: 'Могут оказаться ценным активом в таких областях, \
как психология, социальная работа, преподавание, медицина и искусство. \
Эти профессии позволяют проявлять свои качества, \
такие как социальная ответственность, эмпатия, креативность и интуиция.',

    title5: 'Как работать с представителем данного типа личности:',
    text5: '- Относитесь к ним с уважением, пониманием и прозрачностью.\n\
- Давайте им возможность выразить свои мысли и идеи на работе, \
позвольте им прослеживать часть своей жизни и опыта и рассказывать свою историю.\n\
- Избегайте конфликтов и споров, поскольку они обычно не хотят портить отношения.',

    title6: 'Как ставить задачи:',
    text6: '- Старайтесь давать задания, которые соответствуют их моральным ценностям и исследовательским интересам.\n\
- Дайте им возможность ознакомиться со всеми аспектами проекта.\n\
- Помогайте им раскрыть новые идеи, реализовывать их и давать обратную связь, чтобы они могли вернуться на правильный путь.',

    title7: 'Чем мотивировать:',
    text7: '- Обратите внимание на их потребность в развитии своих талантов.\n\
- Значение работы более важно, чем денежное вознаграждение. Их работа должна иметь глубокий смысл и реальный исход.\n\
- Помните, что они могут быть малочувствительны к ежедневной рутинной работе, поэтому сделайте работу разнообразной и интересной.',

    title8: 'Как решать проблемы и избегать конфликтов:',
    text8: '- Уважайте их интуицию и чувства, их работа часто основана на чувственной составляющей.\n\
- Обратите внимание на их недовольство трудными конфликтами или несправедливостью.\n\
- Будьте открыты к диалогу, позвольте им выразить свои ощущения и предложить решения проблемы.',

    title9: 'Как развивать лидерские способности и управлять командой:',
    text9: '- Предоставьте им возможность вести дискуссии и обсуждения инициатив.\n\
- Старайтесь понимать их видение осуществления проекта и дайте им возможность это сделать.\n\
- Будьте готовы к обсуждению их концепций до того, как вы принимаете конечное решение для проекта.',
}

export const INTJ = {
    title1: 'Описание типа личности:',
    text1: 'Это логический и стратегический тип личности, \
который ориентирован на достижение целей и построение систем. \
Они обладают уникальной способностью видеть вещи далеко вперед \
и могут подойти для ролей, связанных с управлением, \
техническими науками и научными исследованиями. \
Могут оказаться ценным активом для компании благодаря своей аналитической и стратегической мысли.',

    title2: 'Сильные стороны:',
    text2: 'Логические и аналитические, \
они могут быстро и точно анализировать сложные ситуации. \
Они не боятся принимать решения и могут быстро оценить риски и возможности. \
Обладают высокими стандартами и ориентированы на качество во всех аспектах работы.',

    title3: 'Слабые стороны:',
    text3: 'Им может не хватать эмоциональной связи \
с окружающими и они могут слишком сосредоточиться на своих личных целях, \
упуская из виду проблемы других людей. Могут вырабатывать негативное отношение \
к критике и не учитывать мнения других. Иногда могут увлекаться деталями и перфекционизмом, \
что может затягивать работу и приводить к появлению отставания от графика.',

    title4: 'Подходящие профессии:',
    text4: 'Могут оказаться ценным активом в таких областях, \
как научные исследования, управление, консалтинг, технические науки и финансы. \
Эти профессии позволяют проявлять свои качества, такие как аналитический склад ума, \
стратегическое мышление и умение быстро принимать решения.',

    title5: 'Как работать с представителем данного типа личности:',
    text5: '- Будьте точными и конкретными в своих инструкциях.\n\
- Используйте эмпирические данные для обоснования своих позиций и идей, чтобы развить доверие.\n\
- Уважайте их личное пространство и не закидывайте их заданиями на последнюю минуту.',

    title6: 'Как ставить задачи:',
    text6: '- Для них очень важно увидеть большую картину, поэтому старательно объясняйте, как задача соответствует общей цели.\n\
- Дайте им возможность самостоятельно решить, какие шаги нужно сделать на пути к выполнению задачи.\n\
- Проводите ежедневные встречи, чтобы они могли обновлять свой план действий и также сообщать о проблемах.',

    title7: 'Чем мотивировать:',
    text7: '- Сосредоточьтесь на интеллектуальных вызовах и проектах, которые способны расширить их знания и опыт.\n\
- Дайте им возможность поиска истины, чтобы они могли выявлять новые способы решения задач и найти свой интеллектуальный вызов в работе.\n\
- Оставайтесь проактивными в своих целях и достижениях, и поддерживайте их в этом.',

    title8: 'Как решать проблемы и избегать конфликтов:',
    text8: '- Дайте им возможность предоставить свои идеи и решения проблем.\n\
- Уважайте их компетентность и позволяйте им принимать решения, как экспертам в своей области.\n\
- Избегайте конфронтации, вместо этого укажите на их знания и научите их найти компромиссы.',

    title9: 'Как развивать лидерские способности и управлять командой:',
    text9: '- Поддерживайте их самостоятельность при принятии решений.\n\
- Дайте им возможность контролировать время и производительность в рамках своих возможностей.\n\
- Создавайте моменты, когда они могут социализироваться и общаться с другими участниками команды, \
чтобы они могли выполнять задачи с более эффективностью.',
}

export const ISTP = {
    title1: 'Описание типа личности:',
    text1: 'Это технический и практичный тип личности, \
который обладает уникальной способностью быстро адаптироваться \
к новым ситуациям и решать проблемы. Они могут подойти для ролей, \
связанных с инженерией, технологией и производством. \
Могут оказаться ценным активом для компании благодаря \
своей способности к рациональному мышлению и умению быстро решать проблемы.',

    title2: 'Сильные стороны:',
    text2: 'Обладают острым умом и способностью \
быстро решать практические задачи. Они хорошо адаптируются \
к изменяющимся ситуациям и могут эффективно работать в условиях высокого давления. \
Ориентированы на результат и умеют находить оптимальные решения для достижения целей.',

    title3: 'Слабые стороны:',
    text3: 'Могут быть недостаточно организованными и склонными к риску, \
что может приводить к некоторому беспорядку в работе. \
Их также может не хватать социальных навыков и они могут нуждаться в помощи в коммуникации с другими людьми. \
Могут иногда значительно затягивать принятие решений, что может отразиться на повседневной работе.',

    title4: 'Подходящие профессии:',
    text4: 'Могут оказаться ценным активом в таких областях, как производство, \
инженерия, технологии, авиация, строительство и очень подходят для профессий \
требующих быстрого реагирования на переменные и логичного мышления.',

    title5: 'Как работать с представителем данного типа личности:',
    text5: '- Будьте ясными и простыми в своих инструкциях.\n\
- Поощряйте использование практических решений и опыта.\n\
- Помогайте им сосредоточиться на сегодняшнем дне и выполнить текущие задачи.',

    title6: 'Как ставить задачи:',
    text6: '- Дайте им возможность работать самостоятельно и не мешайте им, когда они погружаются в работу.\n\
- Старайтесь делать задания конкретными и реалистичными, чтобы они могли использовать свои навыки и знания.\n\
- Предоставляйте им возможность находить новые подходы к решению проблем.',

    title7: 'Чем мотивировать:',
    text7: '- Дайте им возможность выполнять поставленные задачи в своем собственном ритме.\n\
- Предоставьте им новые вызовы и возможности для использования своих навыков.\n\
- Будьте признательными за их усилия и результаты в своих работах.',

    title8: 'Как решать проблемы и избегать конфликтов:',
    text8: '- Дайте им время на обдумывание и исследование проблем, прежде чем требовать быстрого решения.\n\
- Избегайте эмоциональных ситуаций, используйте факты и данные, чтобы помочь им принять решение.\n\
- Уважайте их личное пространство и не заставляйте их общаться, когда они не готовы.',

    title9: 'Как развивать лидерские способности и управлять командой:',
    text9: '- Дайте им возможность самостоятельно решать проблемы и принимать решения в рамках своих компетенций.\n\
- Обеспечьте им независимую работу и не контролируйте каждый шаг.\n\
- Создайте условия для проявления креативности и новаторства в их работе.',
}

export const ISFP = {
    title1: 'Описание типа личности:',
    text1: 'Это творческий и чувствительный тип личности, \
который обладает уникальной способностью работать с эмоциями \
и воплощать свою интуицию в жизнь. \
Они могут быть ценным активом для компаний, \
связанных с искусством, дизайном, модой, музыкой и другими творческими областями. \
Могут оказаться ценным активом для компаний благодаря своей способности к эмпатии и умению создавать красоту.',

    title2: 'Сильные стороны:',
    text2: 'Обладают креативным мышлением \
и способностью видеть мир своим уникальным образом. \
Они обладают чувством стиля и склонны к творческому проявлению себя. \
Довольно эмпатичны и могут понимать эмоции других людей, \
что позволяет им создавать уникальные и проникновенные произведения искусства.',

    title3: 'Слабые стороны:',
    text3: 'Иногда склонны к прокрастинации и отсутствию организации, \
что может повредить их результативности и производительности. \
Они могут также чувствительно воспринимать критику, \
что может приводить к неэффективной коммуникации на рабочем месте. \
Также могут нуждаться в некоторой степени направляющей поддержки \
и инструкциях, чтобы достичь лучших результатов.',

    title4: 'Подходящие профессии:',
    text4: 'Могут быть ценным активом в таких областях, \
как искусство, дизайн, мода, музыка, графический дизайн и другие творческие области. \
Они хорошо работают в группах, которые ценят креативность и интуицию.',

    title5: 'Как работать с представителем данного типа личности:',
    text5: '- Будьте дружелюбны и доверяйте им.\n\
- Учитывайте их чувства и переживания и старайтесь создавать для них комфортные условия работы.\n\
- Не ограничивайте их творческий потенциал.',

    title6: 'Как ставить задачи:',
    text6: '- Дайте им возможность самостоятельно выбирать методы решения проблем.\n\
- Старайтесь делать задания интересными и вовлекающими.\n\
- Поощряйте их использовать свои навыки и таланты в работе.',

    title7: 'Чем мотивировать:',
    text7: '- Поощряйте их личное развитие и стимулируйте их непрерывное обучение.\n\
- Используйте положительный подход и выражение признательности за их усилия и результаты.\n\
- Создайте в работе для них доступный для творчества простор.',

    title8: 'Как решать проблемы и избегать конфликтов:',
    text8: '- Не перегружайте их работой и не требуйте от них быстрого принятия решений.\n\
- Старайтесь избегать конфликтов и предоставлять им возможность выразить свое мнение и чувства.\n\
- Уважайте их личное пространство и дайте им время на переживание проблем.',

    title9: 'Как развивать лидерские способности и управлять командой:',
    text9: '- Поощряйте их лидерские способности, но не заставляйте их быть лидерами, если они не желают этого.\n\
- Создайте для них комфортные условия, в которых они могут выражать свою креативность и делиться своими идеями.\n\
- Убедитесь, что они понимают и поддерживают цели команды и обеспечьте им достаточную свободу веб-проектов.',
}


export const INFP = {
    title1: 'Описание типа личности:',
    text1: 'Это идеалистичный и вдохновенный тип личности, \
который обладает уникальным чувством морали и справедливости. \
Они могут быть ценным активом для компаний, занимающихся социальными вопросами, \
образованием, искусством и другими областями, \
связанными с креативностью и эмоциональной глубиной. \
Могут оказаться ценным активом для компаний благодаря своей способности \
выражать эмоции и восхищаться красотой.',

    title2: 'Сильные стороны:',
    text2: 'Обладают уникальным чувством морали и справедливости, \
а также могут быть чувствительными к потребностям других людей. \
Они могут лучше понимать эмоции других людей и могут создавать уникальные \
и вдохновляющие произведения искусства. Обычно чувствительны и \
к своим эмоциям и могут являться хорошими дипломатами на рабочем месте.',

    title3: 'Слабые стороны:',
    text3: 'Могут быть слишком критичны к себе и своей работе, \
что может приводить к прокрастинации и отсутствию организации. \
Они могут быть склонны к принятию решений на основе эмоций, \
что может привести к неэффективным решениям на рабочем месте. \
Могут также нуждаться в большей ясности и структуре в заданиях, \
чтобы достичь лучших результатов.',

    title4: 'Подходящие профессии:',
    text4: 'Могут быть ценным активом в социальных вопросах, \
образовании, искусстве, культуре и других областях, которые ценят креативность и эмпатию. \
Они могут также хорошо работать в таких областях, как свободные искусства, \
литература, музыка и другие творческие области.',

    title5: 'Как работать с представителем данного типа личности:',
    text5: '- Будьте дружелюбны и поддерживайте их эмоциональное состояние и вдохновение.\n\
- Старайтесь создавать для них условия, в которых они могут свободно и творчески выражать свои идеи.\n\
- Проявляйте понимание и уважение к их индивидуальности и чувствительности.',

    title6: 'Как ставить задачи:',
    text6: '- Старайтесь понимать, что задачи должны иметь цель и смысл.\n\
- Давайте им возможность работать автономно и выбирать свой метод решения задач.\n\
- Разрешайте им выражать свои мысли и идеи, искать альтернативные решения и не ограничивайте их творческий потенциал.',

    title7: 'Чем мотивировать:',
    text7: '- Оставляйте им место для творчества, поддержки и развития социума.\n\
- Старайтесь создавать для них условия работы, помогающие им ощущать свою значимость.\n\
- Поощряйте их развитие и обучение.',

    title8: 'Как решать проблемы и избегать конфликтов:',
    text8: '- Старайтесь давать им достаточно времени на изучение информации и анализ ситуации для принятия взвешенного, чувствительного решения.\n\
- Уважайте их чувства и мнение, дайте им возможность высказаться и проявлять свою эмпатию.\n\
- Стремитесь избегать конфликтов, концентрируясь на общем благе и достигаемых результатах.',

    title9: 'Как развивать лидерские способности и управлять командой:',
    text9: '- Помогайте им найти свои лидерские качества и развивать их, причем без насильственного давления.\n\
- Создавайте для них возможности для творческого самовыражения и продолжайте вырабатывать навыки руководства и организации.\n\
- Разрешайте им делиться своими идеями и мнениями, цените их работу и обратите внимание на их статьи на блогах и сообществах.',
}


export const INTP = {
    title1: 'Описание типа личности:',
    text1: 'Это аналитический и интеллектуальный тип личности, \
который может стать ценным активом для компаний, занимающихся наукой, \
технологией, инновациями и другими областями, требующими глубокой аналитики и логического мышления. \
Могут помочь компаниям в поиске новых идей \
и разработке инновационных проектов благодаря \
своей способности анализировать информацию и получать новые знания.',

    title2: 'Сильные стороны:',
    text2: 'Обладают уникальной способностью анализировать \
и обрабатывать информацию, а также могут отличаться своими логическим \
и критическим мышлением. Они часто способны находить новые идеи и решения для сложных проблем, \
а также могут хорошо работать в напряженных ситуациях. \
Обычно ценят свою независимость и могут хорошо работать самостоятельно.',

    title3: 'Слабые стороны:',
    text3: 'Могут быть склонны к анализу и переработке информации до бесконечности, \
что может вести к прокрастинации и отсутствию организации. \
Они могут также быть несколько социально неуклюжими и иметь трудности \
в коммуникации с другими людьми. Также могут нуждаться в большей мотивации \
и стимуле, чтобы достигать лучших результатов.',

    title4: 'Подходящие профессии:',
    text4: 'Могут быть ценным активом в таких областях, \
как наука, технология, инновации, инженерия и другие области, \
где требуется скрупулезная аналитика и логическое мышление. \
Они могут также хорошо работать в таких областях, как компьютерные науки, математика, \
статистика и другие области, требующие глубокой экспертизы и знаний.',

    title5: 'Как работать с представителем данного типа личности:',
    text5: '- Дайте им возможность работать над своими проектами и исследованиями для достижения лучших результатов.\n\
- Старайтесь создавать для них условия, в которых они могут свободно выражать свои идеи и заниматься любимым делом.\n\
- Разрешайте им работать автономно и не контролировать каждое их действие.',

    title6: 'Как ставить задачи:',
    text6: '- Задачи должны быть понятны и иметь конкретный результат.\n\
- Старайтесь избегать жестких сроков и дать возможность работать в своем темпе.\n\
- Разрешайте их интеллектуальной любознательности и уважайте их желание изучать новые области науки.',

    title7: 'Чем мотивировать:',
    text7: '- Уважайте их интеллектуальные возможности и цените их разносторонние интересы.\n\
- Давайте им возможность совершенствоваться и изучать новое.\n\
- Поощряйте их креативность и возможность свободно выражаться.',

    title8: 'Как решать проблемы и избегать конфликтов:',
    text8: '- Старайтесь давать им время для обдумывания проблем и поиска оптимального решения.\n\
- Оставайтесь терпеливыми и демонстрируйте свою уверенность в их интеллектуальных способностях.\n\
- Избегайте давления или конфронтации, попробуйте найти компромисс или общую землю.',

    title9: 'Как развивать лидерские способности и управлять командой:',
    text9: '- Старайтесь помочь им найти свои лидерские качества и развивать их.\n\
- Разрешайте им принимать решения и руководить, ставьте цели и оставляйте им свободу выбора маршрута достижения этих целей.\n\
- Создавайте условия для творческой работы, доверяя им научные и исследовательские проекты и поощряя их личное развитие.',
}


export const ESTP = {
    title1: 'Описание типа личности:',
    text1: 'Это энергичный и действенный тип личности, \
который может стать ценным активом для компаний, \
занимающихся бизнесом, маркетингом, продажами и другими областями, \
которые требуют быстрого принятия решений и эффективного взаимодействия с людьми. \
Они могут помочь компаниям в установлении контактов с новыми клиентами \
и увеличении продаж благодаря своей спонтанности и открытости.',

    title2: 'Сильные стороны:',
    text2: 'Обладают высокой энергией и мастерством во взаимодействии с людьми. \
Они обычно способны легко и быстро адаптироваться к новым ситуациям и быстро принимать решения. \
Отличаются своей активностью и инициативностью, \
что позволяет им легко находить новые возможности и развивать бизнес.',

    title3: 'Слабые стороны:',
    text3: 'Могут быть несколько нерешительными в долгосрочном планировании \
и стратегическом мышлении. Им может не хватать терпения и упорства, \
чтобы достичь долгосрочных целей. Также они могут быть склонны к рискованным решениям \
и чрезмерной уверенности в себе, что может приводить к проблемам.',

    title4: 'Подходящие профессии:',
    text4: 'Могут быть ценным активом в таких областях, как бизнес, \
маркетинг, продажи и другие области, требующие быстрого принятия решений \
и эффективного взаимодействия с людьми. Они могут также хорошо работать в таких областях, \
как спорт, развлечения, гостиничный бизнес и др.',

    title5: 'Как работать с представителями данного типа личности:',
    text5: '- Быть конкретным и четким в своих указаниях и инструкциях, так как они предпочитают действовать, а не думать.\n\
- Дать им возможность работать в креативной обстановке и разнообразить их рабочий день, чтобы они не скучали и не теряли интерес.\n\
- Быть готовым к общению и принимать участие в их играх и шутках.',

    title6: 'Как ставить задачи:',
    text6: '- Предоставлять задачи, которые требуют быстрого принятия решений и сочетают в себе физическую и эмоциональную активность.\n\
- Объяснять задачу не только словами, но и демонстрировать ее на практике.\n\
- Давать возможность сотрудничать и соревноваться, так как они любят конкуренцию.',

    title7: 'Чем мотивировать:',
    text7: '- Предоставлять им возможность проявить свои лидерские способности и получить узнаваемость при выполнении задач.\n\
- Оценивать их результаты и успехи, особенно в присутствии других.\n\
- Предоставлять им возможность работать с разнообразными задачами и проектами.',

    title8: 'Как решать проблемы и избегать конфликтов:',
    text8: '- Быть готовым к конструктивным дебатам и предоставлять им возможность выражать свое мнение.\n\
- Не использовать критику, а давать им поддержку и позитивные рекомендации.\n\
- Не давать время на принятие решения, так как они предпочитают действовать быстро и без раздумий.',

    title9: 'Как развивать лидерские способности и управлять командой:',
    text9: '- Давать им возможность принимать ответственность за проекты и задачи.\n\
- Предоставлять им автономию в принятии решений и управлении своим временем.\n\
- При поддержке и стимулировании их идей, позволить им проявить свои возможности и управлять командой.',
}


export const ESFP = {
    title1: 'Описание типа личности:',
    text1: 'Это жизнерадостный и эмоциональный тип личности, \
который может стать ценным активом для компаний, занимающихся бизнесом, \
маркетингом, продажами и другими областями, которые требуют внимательности \
к клиентам и развития связей. Могут помочь компаниям в привлечении новых \
клиентов и укреплении имиджа благодаря своей общительности и энтузиазму.',

    title2: 'Сильные стороны:',
    text2: 'Обладают высоким чувством юмора, теплой натурой \
и легкостью в общении с людьми. Они имеют отличные навыки в межличностных отношениях \
и могут быстро наладить связи с новыми людьми. Также обладают энергией и оптимизмом, \
что может помочь им в нахождении новых возможностей и создании выгодных условий для бизнеса.',

    title3: 'Слабые стороны:',
    text3: 'Могут быть иногда не такими организованными и системными, \
как это требуется для выполнения более рутинных задач. Они могут также проявлять \
излишнюю чувствительность к критике и критику, что может затруднять достижение целей. \
Могут иногда быть несколько склонны к переключению между различными проектами, \
что может приводить к недостатку фокуса и концентрации.',

    title4: 'Подходящие профессии:',
    text4: 'Могут быть ценным активом в таких областях, как бизнес, \
маркетинг, продажи, гостеприимство и другие области, которые требуют внимания к \
клиентам и межличностным отношениям. Они могут также хорошо работать в культурных индустриях, \
таких как музыка, театр и искусство.',

    title5: 'Как работать с представителем данного типа личности:',
    text5: '- Быть доступным и дружелюбным в общении, так как они предпочитают работу в приятной обстановке.\n\
- Проявлять понимание и уважение к их эмоциональным потребностям.\n\
- Обеспечивать коммуникацию и общение с другими коллегами, так как они очень контактны и общительны.',

    title6: 'Как ставить задачи:',
    text6: '- Давать разнообразные задачи, которые потребуют физической активности и социального взаимодействия.\n\
- Обеспечить им возможность творческого воплощения своих идей.\n\
- Помочь определить, как задача соотносится с их общими целями и интересами.',

    title7: 'Чем мотивировать:',
    text7: '- Показывать признание за их энергию и творческие успехи.\n\
- Предоставлять возможность работать с разнообразными задачами и проектами.\n\
- Давать им возможность общаться и работать в команде.',

    title8: 'Как решать проблемы и избегать конфликтов:',
    text8: '- Не подавлять их эмоции и чувства, а учитывать их мнения и взгляды.\n\
- Предоставить время для решения конфликта и для выражения своих чувств.\n\
- Искать компромисс, который удовлетворит все стороны.',

    title9: 'Как развивать лидерские способности и управлять командой:',
    text9: '- Определить в команде роль в соответствии с их индивидуальными способностями и интересами.\n\
- Давать им возможность работать в своем темпе и рисковать, чтобы достичь успеха.\n\
- Помочь им стать лидером, предоставив гибкость, необходимую для того, чтобы вернуться в команду.',
}


export const ENFP = {
    title1: 'Описание типа личности:',
    text1: 'Это креативный и вдохновленный тип личности, \
который может стать ценным активом для компаний, \
занимающихся маркетингом, рекламой, социальными медиа \
и другими областями, которые требуют воображения и новаторства. \
Они могут помочь компаниям в развитии новых идей и творческом подходе к проблемам.',

    title2: 'Сильные стороны:',
    text2: 'Обладают творческим мышлением, \
энергией и оптимизмом, что может помочь им в нахождении новых решений \
и создании выгодных условий для бизнеса. Они могут быть отличными коммуникаторами, \
что позволяет им находить общий язык с людьми из разных сфер \
и устанавливать продуктивные рабочие отношения.',

    title3: 'Слабые стороны:',
    text3: 'Могут иногда склоняться к проявлению некоторой непостоянности \
и неустойчивости в работе, особенно если им не удастся увлечься проектом. \
Они могут также проявлять излишнюю эмоциональность в работе и могут терять концентрацию в долгосрочных задачах.',

    title4: 'Подходящие профессии:',
    text4: 'Могут быть ценным активом в таких областях, \
как маркетинг, реклама, социальные медиа, образование, визуальные искусства \
и другие области, которые требуют креативности и инновационного подхода к работе.',

    title5: 'Как работать с представителем данного типа личности:',
    text5: '- Быть доступным для общения и выслушивания их идей и мнений.\n\
- Предоставлять им свободу в творческом процессе и при работе в команде.\n\
- Помогать им создавать прочные связи с коллегами и устанавливать профессиональные контакты.',

    title6: 'Как ставить задачи:',
    text6: '- Предоставлять задачи, позволяющие реализовать личностные возможности.\n\
- Предоставлять условия для творческого роста.\n\
- Помогать определить ценность и смысл задачи, чтобы они могли лучше сосредоточиться на работе.',

    title7: 'Чем мотивировать:',
    text7: '- Показывать признание за творческие успехи и достижения целей.\n\
- Сохранять сильную мотивацию, предоставляя множество новых задач и проектов.\n\
- Организовывать возможность коммуникации и дружеского взаимодействия с коллегами.',

    title8: 'Как решать проблемы и избегать конфликтов:',
    text8: '- Быть чутким и выслушивать точки зрения, чтобы избежать возможных конфликтов в социальных ситуациях.\n\
- Помогайте определить, какие задачи стоят их перед коллегами, чтобы они могли оптимально участвовать в процессе.\n\
- Сосредоточиться на социальных отношениях и типе коммуникации, которые они предпочитают.',

    title9: 'Как развивать лидерские способности и управлять командой:',
    text9: '- Давайте колоссальную привлекательность и возможность выводить оригинальные идеи других членов команды, при этом поддерживая "интерес за работу".\n\
- Активно участвуйте в креативных процессах помогайте им развивать свои лидерские качества.\n\
- Давайте возможность команде эффективно сотрудничать и мотивироваться.',
}


export const ENTP = {
    title1: 'Описание типа личности:',
    text1: 'Это тип личности с развитым интеллектом и аналитическим мышлением. \
Они могут быть ценным активом для компаний, занимающихся консалтингом, исследованиями, \
разработкой продуктов и других областей, которые требуют инновационного и рационального подхода.',

    title2: 'Сильные стороны:',
    text2: 'Обычно обладают развитой интуицией и энергией, \
что позволяет им быстро анализировать сложные проблемы и находить эффективные решения. \
Они могут быть отличными коммуникаторами и аргументаторами, \
что позволяет им убеждать и вдохновлять других людей.',

    title3: 'Слабые стороны:',
    text3: 'Могут быть склонны к проявлению некоторой непостоянности \
и неорганизованности в работе, особенно если им не удастся заинтересоваться проектом. \
Они могут также проявлять излишнюю агрессивность и нетерпимость к другим людям.',

    title4: 'Подходящие профессии:',
    text4: 'Могут быть ценным активом в таких областях, как консалтинг, \
исследования, разработка продуктов, IT, маркетинг и другие области, \
которые требуют инновационного и рационального подхода к работе.',

    title5: 'Как работать с представителем данного типа личности:',
    text5: '- Быть готовым к прямым дискуссиям и диалогам и не считать это конфликтом.\n\
- Предоставлять объективную обратную связь и возможность участвовать в процессе принятия решений.\n\
- Уверенность и доверие в их способности.',

    title6: 'Как ставить задачи:',
    text6: '- Предоставлять интересные, сложные и многогранные задачи.\n\
- Предоставлять возможность для творческих решений и новых идей.\n\
- Работать над практическими и реалистичными целями.',

    title7: 'Чем мотивировать:',
    text7: '- Предоставлять работу с интересными задачами и проектами.\n\
- Помогать им видеть вклад своей работы в амбициозные и важные проекты.\n\
- Предоставлять гибкое место работы, чтобы они могли удовлетворять свои требования и запросы в процессе работы.',

    title8: 'Как решать проблемы и избегать конфликтов:',
    text8: '- Быть готовым к дискуссиям и обратной связи.\n\
- Понимать, что они могут отстаивать свою точку зрения и быть решительными в принятии решений.\n\
- Поддерживать конструктивное обсуждение и признание аргументации, используемой ими.',

    title9: 'Как развивать лидерские способности и управлять командой:',
    text9: '- Предоставлять возможность для руководства и принятия решений на высоком уровне.\n\
- Предоставлять материал для улучшения и развития лидерских качеств.\n\
- Обеспечить их членами команды, которые могут эффективно работать вместе с ними и помогать им достигать результатов.',
}


export const ESTJ = {
    title1: 'Описание типа личности:',
    text1: 'Это тип личности с организованным и практичным подходом к работе. \
Они могут быть ценным активом для компаний, занимающихся управлением, производством, \
бухгалтерией и другими областями, которые требуют тщательного планирования \
и эффективного управления ресурсами.',

    title2: 'Сильные стороны:',
    text2: 'Обычно обладают высоким уровнем ответственности и усердия. \
Они предпочитают работать в ясно определенных структурах и процессах, \
что позволяет им быть более продуктивными.Могут также быть отличными лидерами, \
которые способны мотивировать и организовывать других людей.',

    title3: 'Слабые стороны:',
    text3: 'Могут быть склонны к консервативному и органиченному мышлению, \
а также к недостаточному вниманию новым идеям и методам работы. \
Они могут также проявлять излишнюю жесткость и категоричность в процессе принятия решений.',

    title4: 'Подходящие профессии:',
    text4: 'Могут быть ценным активом в таких областях, \
как управление, производство, бухгалтерия, юриспруденция, медицина \
и другие области, которые требуют тщательного планирования и эффективного управления ресурсами.',

    title5: 'Как работать с представителем данного типа личности:',
    text5: '- Быть четким и конкретным в инструкциях и описании работы.\n\
- Следовать правилам и стандартам, установленным в организации.\n\
- Предоставить структурированную и организованную среду работы.',

    title6: 'Как ставить задачи:',
    text6: '- Давать четкие и ясные инструкции и привязывать их к серьезным целям.\n\
- Предоставлять возможность использовать свою системность и упорядоченность в работе.\n\
- Указывать на конечный результат работы и четко определять сложность задачи.',

    title7: 'Чем мотивировать:',
    text7: '- Поощрять выполнение стандартов и производительности, а также обратную связь.\n\
- Поддерживать четкую линию деятельности и последовательность в работе.\n\
- Предоставлять возможность брать на себя ответственность.',

    title8: 'Как решать проблемы и избегать конфликтов:',
    text8: '- Не допускать нечеткости и недостатка информации при решении проблем.\n\
- Предоставлять определенность решения и возможное воздействие на действия в будущем.\n\
- Поддерживать процесс, который необходим им для принятия решения.',

    title9: 'Как развивать лидерские способности и управлять командой:',
    text9: '- Давать возможность работать в зоне комфорта, т.е. устанавливать контроль и надзор.\n\
- Разрабатывать четкие стандарты и ожидания от команды, которые они могут привнести в работу.\n\
- Определять роли и задачи каждого члена команды, чтобы обеспечить четкий и определенный процесс работы.',
}


export const ESFJ = {
    title1: 'Описание типа личности:',
    text1: 'Это тип личности с эмоциональным и социальным подходом к работе. \
Они могут быть ценным активом для компаний, занимающихся социальными услугами, \
продажами, маркетингом и другими областями, которые требуют внимания к клиентам \
и хорошим коммуникативным навыкам.',

    title2: 'Сильные стороны:',
    text2: 'Обычно обладают высоким уровнем эмоциональной и социальной интеллектуальности. \
Они предпочитают работать в команде и могут быть отличными командными игроками. \
Могут также быть отличными обслуживающими работниками, которые способны отзываться \
на нужды клиентов и хорошо ориентированы в социальных взаимоотношениях.',

    title3: 'Слабые стороны:',
    text3: 'Могут быть склонны к перфекционизму и излишней заботе о других людях. \
Иногда они могут забывать о своих собственных потребностях и занятости. \
Также могут страдать от боязни конфликтов и избегать принятия решений, \
которые могут привести к потенциальному конфликту.',

    title4: 'Подходящие профессии:',
    text4: 'Могут быть ценным активом в областях, \
таких как социальные услуги, продажи, маркетинг, образование, здравоохранение, \
гостеприимство и другие области, которые требуют хороших коммуникативных навыков и внимания к клиентам.',

    title5: 'Как работать с представителем данного типа личности:',
    text5: '- Быть дружелюбным, вежливым и поддерживать теплые отношения.\n\
- Предоставить возможность для общения с коллегами и знакомства.\n\
- Поддерживать уважительную и доброжелательную атмосферу в офисе.',

    title6: 'Как ставить задачи:',
    text6: '- Быть четким и понятным в описании задач и ожиданий от работника.\n\
- Дать возможность работать с людьми и используйте их хорошие коммуникативные навыки при постановке задач.\n\
- Позволять работать в коллективе и управлять социальными взаимодействиями.',

    title7: 'Чем мотивировать:',
    text7: '- Отмечать достижения работников и давать положительную обратную связь.\n\
- Предоставлять возможность помогать другим людям и влиять на их жизнь.\n\
- Создавать командный дух и поддерживать связи между работниками.',

    title8: 'Как решать проблемы и избегать конфликтов:',
    text8: '- Давать возможность высказывать свои мысли и чувства.\n\
- Предлагать альтернативные решения проблем и учитывать их мнение.\n\
- Работать с конфликтами и обеспечивать чувство безопасности для всех работников.',

    title9: 'Как развивать лидерские способности и управлять командой:',
    text9: '- Поощрять их управлять людьми и работать на благо всех.\n\
- Предоставить групповые задачи и проекты, чтобы они могли использовать свои лидерские способности.\n\
- Создавать планы развития, которые помогут им развиваться в роли лидера.',
}


export const ENFJ = {
    title1: 'Описание типа личности:',
    text1: 'Это тип личности, который обладает высоким уровнем эмоциональной \
и социальной интеллектуальности. Они могут быть ценным активом для компаний, \
которые занимаются маркетингом, рекламой, управлением ресурсами человеческих кадров, \
образованием и другими областями, которые требуют лидерства, коммуникации и умения вести переговоры.',

    title2: 'Сильные стороны:',
    text2: 'Обладают высоким уровнем эмпатии, \
они легко устанавливают контакт с другими людьми и обладают \
способностью мотивировать и организовывать их. \
Они ориентированы на результаты и приоритет ставят на благополучие команды и клиентов. \
Также обладают высоким уровнем социального интеллекта, \
что делает их способными решать сложные социальные проблемы \
и организовывать эффективное взаимодействие во время коллективных проектов и совместных дел.',

    title3: 'Слабые стороны:',
    text3: 'Могут быть склонны к излишней заботе о своих сотрудниках и клиентах, \
что может привести к выгоранию и изматыванию. Они могут также страдать от перфекционизма, \
который может замедлять их работу. Могут бояться конфликтов, \
что может привести к избеганию принятия решений, необходимых для успешного завершения задачи.',

    title4: 'Подходящие профессии:',
    text4: 'Могут проявить себя в профессиях, \
связанных с управлением персоналом, маркетингом, образованием, рекламой, \
психологией и других областях, где они смогут использовать \
свои лидерские и организационные способности.',

    title5: 'Как работать с представителем данного типа личности:',
    text5: '- Быть дружелюбным, теплым и поддерживать эмоциональную связь.\n\
- Оценить сильные стороны в области управления и мотивации.\n\
- Позволить работать в команде и принимать участие в общении.',

    title6: 'Как ставить задачи:',
    text6: '- Предоставлять возможность работать с людьми и использовать их хорошие коммуникативные навыки.\n\
- Давать четкие указания по выполнению задачи и мотивировать ознакомиться с результатами.\n\
- Показывать, какие преимущества может получить компания в результате выполнения задачи.',

    title7: 'Чем мотивировать:',
    text7: '- Предоставлять возможность управлять ситуациями и продвигать свою точку зрения.\n\
- Признавать их заслуги и достижения.\n\
- Давать возможность работать в области, которая помогает другим людям и влиять на их жизнь.',

    title8: 'Как решать проблемы и избегать конфликтов:',
    text8: '- Давать возможность высказывать свои мысли и чувства.\n\
- Предлагать альтернативные решения проблем и учитывать их мнение.\n\
- Решать конфликты в тихой и спокойной обстановке.',

    title9: 'Как развивать лидерские способности и управлять командой:',
    text9: '- Задавать цели и направлять на руководящие посты.\n\
- Предоставлять возможности для управления группами и учета всех мнений.\n\
- Создавать планы развития, которые помогут развиваться в роли лидера.',
}


export const ENTJ = {
    title1: 'Описание типа личности:',
    text1: 'Это тип личности, который обладает высокой энергией, \
лидерскими способностями и стремлением к достижению целей. \
Они могут быть ценными для компаний, \
которые нуждаются в уверенных и эффективных руководителях.',

    title2: 'Сильные стороны:',
    text2: 'Обладают развитыми лидерскими качествами, \
они легко организуют и управляют командами и эффективно решают проблемы. \
Они имеют высокий уровень аналитических навыков, что позволяет \
им участвовать в стратегических планированиях. \
Хорошо знают свои цели и работают на их достижение, \
они умеют работать в условиях стресса и неутомимо продолжают двигаться вперед.',

    title3: 'Слабые стороны:',
    text3: 'Могут быть чрезмерно критичными \
и иметь высокие стандарты как для себя, так и для других. \
Они могут быть властными и высказывать свою точку зрения настойчиво, \
что может приводить к конфликтам в рабочей команде. \
Также могут быть неуверенными в отношении ситуаций, \
которые не имеют строгих правил или градаций.',

    title4: 'Подходящие профессии:',
    text4: 'Могут проявить себя в профессиях, \
связанных с управлением, правом, финансами, наукоемких отраслях, \
связанных с технологиями и инженерией, а также в маркетинге и рекламе.',

    title5: 'Как работать с представителем данного типа личности:',
    text5: '- Быть прямолинейным, честным и эффективным в управлении.\n\
- Оценить сильные стороны в области лидерства и стратегического планирования.\n\
- Не бояться конфронтации и уметь рационально дискутировать.',

    title6: 'Как ставить задачи:',
    text6: '- Предоставлять возможность работать в области лидерства и принимать стратегические решения.\n\
- Давать четкие и конкретные требования и контролировать выполнение задач.\n\
- Показывать, какие преимущества может получить компания в результате выполнения задачи.',

    title7: 'Чем мотивировать:',
    text7: '- Предоставлять возможность управления процессами и реализации идей.\n\
- Признавать заслуги и достижения, давать возможность продвигаться по карьерной лестнице.\n\
- Расширять их сферу влияния, давая им возможность управлять более крупными проектами.',

    title8: 'Как решать проблемы и избегать конфликтов:',
    text8: '- Быть прямолинейным и предельно честным, ясно выражать свою позицию.\n\
- Включать в процесс принятия решений.\n\
- Избегать мелочных деталей, сосредоточившись на конечной цели.',

    title9: 'Как развивать лидерские способности и управлять командой:',
    text9: '- Предоставлять возможности управлять группами и принимать ответственность за коллектив.\n\
- Обеспечивать достаточный уровень автономности и ориентированности на наибольшую эффективность работы.\n\
- Создавать планы развития, которые помогут развить способности по улучшению работы команды и управлению проектами.',
}


