

export const ISTJ = {
    title1: 'Описание типа личности:',
    text1: 'Это логически мыслящий и организованный тип личности, \
который знаменит своей ответственностью и сосредоточенностью на деталях. \
Они любят следовать определенным правилам и процедурам и склонны к сохранению статус-кво. \
Ориентированы на достижение целей и практические результаты, \
их работа характеризуется высокой приверженностью и дисциплиной.',

    title2: 'Сильные стороны:',
    text2: 'Надежные и ответственные работники, \
чей труд характеризуется точностью и пунктуальностью. \
Являясь хорошими логиками, они рационально оценивают ситуации, \
избегают рисков и проявляют рациональность при принятии решений',

    title3: "Слабые стороны:",
    text3: "часто слишком пристрастны к следованию правилам, \
что может препятствовать инновациям или решению проблем. \
Иногда они могут быть недостаточно гибкими в обстановках, \
которые требуют быстрого реагирования. \
Также они склонны к подавлению своих эмоций \
и могут не замечать эмоциональных потребностей окружающих.",

    title4: 'Подходящие профессии:',
    text4: 'Наиболее успешны в профессиях, где необходимо высокое качество, \
точность и дисциплина, например, бухгалтеры, юристы, инженеры, \
менеджеры по производству, педагоги, врачи и др.',

    title5: 'Как работать с представителем данного типа личности:',
    text5: '- Не ожидайте от них сильно выразительных эмоций и экспрессии. Они обычно выглядят спокойными и уравновешенными.\n\
- Уважайте их систематичный подход к работе. Они любят, когда задачи структурированы и четко определены.\n\
- Будьте терпеливы при работе с ним, он может быть более медленным, но стабильным работником.\n\
Это человек, который обычно следует правилам и процедурам. Работодатель должен предоставить ему ясную инструкцию по работе, \
а затем дать возможность работать самостоятельно. Важно создавать стабильную и организованную атмосферу на рабочем месте, \
где каждый знает свои обязанности и правила взаимодействия.',

    title6: 'Как ставить задачи:',
    text6: '- Предоставьте им четкие инструкции и конкретные цели для достижения.\n\
- Дайте возможность работать в медленном темпе, чтобы они могли закончить свою работу тщательно и точно.\n\
- Уделите внимание деталям, они обычно очень внимательны к деталям и отвечают за качество своей работы.\n\
Они обычно любят, когда работа структурирована и планомерна. Работодатель должен ставить ясные и конкретные задачи \
с четкой формулировкой целей и ожиданий. Также они обычно точны и подробны, поэтому важно ожидать высокого качества выполнения задач.',

    title7: 'Чем мотивировать:',
    text7: '- Поощряйте их точность и признавайте их усилия.\n\
- Дайте им возможность работать самостоятельно и контролировать свою работу.\n\
- Используйте систему вознаграждений для стимулирования лучшей работы.\n\
Их не всегда легко мотивировать, так как они часто занимаются рутинной работой, \
которая может быть скучной и монотонной. Работодатель может помочь, обеспечивая четкие цели и структурированную работу, \
а также давая обратную связь и вознаграждения за успешное выполнение задач.',

    title8: 'Как решать проблемы и избегать конфликтов:',
    text8: '- Старайтесь давать четкие инструкции и убедитесь, что они понимают, что от них требуется.\n\
- Будьте аккуратны с критикой, они не любят проявлять слишком много эмоций, и критика может их пугать.\n\
- Избегайте конфликтов, они могут трудно переносить неприятности и стресс.\n\
Они обычно очень практичны и критически мыслят. Если возникает проблема, \
будут искать решение на основе фактов и логических аргументов. \
Чтобы избежать конфликтов, работодатель должен обеспечивать четкую коммуникацию, \
понимать и уважать точки зрения и давать возможность доказать свою точку зрения.',

    title9: 'Как развивать лидерские способности и управлять командой:',
    text9: '- Они хорошо знают, что им нужно сделать, и наиболее эффективны, когда им дали конкретные задачи. \
Предоставьте им ясные цели и план действий.\n\
- Дайте им возможность вести работу самостоятельно, они не слишком подходят для работы в команде.\n\
- Укажите на структуру и порядок, они обычно ценят планирование и ясность.\n\
Это тип личности, который не всегда стремится к лидерству, но они могут быть отличными руководителями благодаря своей ответственности, \
организованности, стойкости и практичности. Работодатель может помочь им в развитии лидерских качеств, \
обеспечивая менторство и обучение, развивая коммуникационные и организационные навыки, и предоставляя возможности работать на больших комплексных проектах.\n\
\n\
Как итог, работа с представителями этого типа может быть построена на четком планировании, \
структурированности, организованности и отношении с вызовом по отношению к выполнению формальных правил. \
Работодатель должен обеспечить удовлетворение начальных требований и необходимых условий, а они станут надежными, \
профессионально ориентированными и ответственными исполнителями.',
}

export const ISFJ = {
    title1: 'Описание типа личности:',
    text1: 'Это бережный и дружелюбный тип личности, \
который проявляет заботу о своих коллегах и организации. \
Они чувствительны к потребностям других людей \
и склонны к следованию традициям и установленным правилам. \
Могут оказаться бесценным активом для компании благодаря своей надежности и заботливости.',

    title2: 'Сильные стороны:',
    text2: 'Лучшие практические работники, \
надежные и добросовестные. Они сильны в межличностных \
взаимодействиях и заботятся о комфорте окружающих, \
проявляют высокую степень дисциплины и ответственности в своей работе.',

    title3: 'Слабые стороны:',
    text3: 'Им может не хватать уверенности в себе в новых ситуациях, \
они могут слишком привязываться к традициям и прошлому, \
что может препятствовать инновациям. Они могут не проявлять \
достаточное количеством инициативы и креативности.',

    title4: 'Подходящие профессии:',
    text4: 'Имеют отличные навыки в области организации и межличностных отношений, \
поэтому они выгодно проявляют себя в области медицины, \
образования, библиотечных, юридических и административных профессиях.',

    title5: 'Как работать с представителем данного типа личности:',
    text5: '- Старайтесь спокойно общаться с ними и уважать их личное пространство.\n\
- Будьте терпеливы и дайте им достаточно времени, чтобы проявить свои способности.\n\
- Избегайте конфликтов, они не любят конфликты и разногласия.\n\
Они нуждаются в поддерживающей, заботливой и деликатной обстановке на рабочем месте, \
чтобы чувствовать себя комфортно и продуктивно работать. Работодатель должен создавать \
вокруг них эргономичную и жизнеспособную среду, помогающую при решении задач и на выполнении проектов.',

    title6: 'Как ставить задачи:',
    text6: '- Давайте очень конкретные и понятные инструкции. Они ценят ясность и четкость.\n\
- Постарайтесь избегать неожиданностей и стараться, чтобы задача и ее результат был заранее определенным.\n\
- Поощряйте и подчеркивайте важность их работы, их любовь к заботе о других людях.\n\
Они обычно лояльны и последовательны, и поэтому предпочитают работу, которая определена и структурирована. \
Работодатель должен ставить ясные и конкретные задачи, предоставлять необходимые ресурсы и готовить поддержку на случай возникновения трудностей.',

    title7: 'Чем мотивировать:',
    text7: '- Определите их личные мотивы и желания. Старайтесь быстро найти те способы, которые могут вдохновить их на работу.\n\
- Поощряйте и оценивайте их личный вклад и усилия.\n\
- Помните, что они больше мотивируются комфортным и стабильным окружением.\n\
Заботятся о других и часто трудно принимают комплименты или вознаграждения за свои действия. \
Работодатель должен показать их важность и находить способы признать их усилия, \
поощряя их участие в командных мероприятиях и обеспечивая четкий и прозрачный механизм обратной связи.',

    title8: 'Как решать проблемы и избегать конфликтов:',
    text8: '- Будьте деликатны в общении и избегайте конфликтных ситуаций.\n\
- Старайтесь находить решения с помощью логического подхода, которые гарантируют их безопасность и благополучие.\n\
- Будьте терпеливы и внимательны к их взгляду на жизнь, они уникальны и заботливы \
и любят принимать решения, которые вписываются в их систему ценностей.\n\
Они обычно заботятся о других людях в команде и склонны заниматься разрешением конфликтных ситуаций. \
Они, также обычно бывают не экспрессивными и опасаются конфликтов. Работодатель должен обеспечить структуру или процесс для обсуждения проблем, \
и дать возможность участникам команды высказывать свои идеи и мнения по отношению к решению конкретной проблемы.',

    title9: 'Как развивать лидерские способности и управлять командой:',
    text9: '- Склонны к выполнению задач и работе в комманде, однако они не стремятся быть лидерами.\n\
- Наблюдайте и определите их цели и мотивы.\n\
- Предоставьте им возможность заботиться о людях и использовать свои знания в этой области, \
тому что приведет к стабильной производительности в команде.\n\
Обычно не стремятся к лидерству, но они могут быть хорошими наставниками и менторами. \
Работодатель должен обеспечить инструкции, наставничество и обучение, чтобы развивать их лидерские навыки, \
такие как управление проектами, мотивация команды и развитие вокруг них эффективной коммуникации и координации.\n\
\n\
В целом, работа с представителями данного типа личности может быть построена на заботе, \
регулярной обратной связи и структурированных задачах. Работодатель должен обеспечить структуру и стабильный процесс работы, \
а они станут надежными, мотивированными и ответственными работниками, которые готовы помогать другим и следовать своим целям и наставлениям.',
}

export const INFJ = {
    title1: 'Описание типа личности:',
    text1: 'Это интуитивный и эмпатичный тип личности, \
который ориентирован на помощь людям и обществу в целом. \
Они обладают необычайной способностью понимать \
и чувствовать потребности других людей и могут подойти для ролей, \
связанных с социальной работой, консультированием, преподаванием и терапией. \
Могут оказаться ценным активом для компании благодаря своей креативности \
и способности к анализу сложных ситуаций.',

    title2: 'Сильные стороны:',
    text2: 'Творческие и интуитивные, \
они могут оказаться инноваторами в своей области. \
Они искренне заботятся о других людях и могут быть великолепными лидерами и наставниками. \
Имеют высокую социальную ответственность \
и обладают уникальной способностью рассматривать проблемы со всех сторон.',

    title3: 'Слабые стороны:',
    text3: 'Им может не хватать уверенности в себе \
и они могут слишком часто сомневаться в своих способностях. \
Они могут страдать из-за перенасыщения эмоций других людей \
и быть недостаточно осторожными в отношении личной границы. \
Иногда могут слишком увлекаться вопросами человеческой психологии, \
что может привести к недостаточному вниманию к коммерческой стороне бизнеса.',

    title4: 'Подходящие профессии:',
    text4: 'Могут оказаться ценным активом в таких областях, \
как психология, социальная работа, преподавание, медицина и искусство. \
Эти профессии позволяют проявлять свои качества, \
такие как социальная ответственность, эмпатия, креативность и интуиция.',

    title5: 'Как работать с представителем данного типа личности:',
    text5: '- Относитесь к ним с уважением, пониманием и прозрачностью.\n\
- Давайте им возможность выразить свои мысли и идеи на работе, \
позвольте им прослеживать часть своей жизни и опыта и рассказывать свою историю.\n\
- Избегайте конфликтов и споров, поскольку они обычно не хотят портить отношения.\n\
Сотрудники с этим типом личности высоко ценят чувства и эмоциональное состояние других людей. \
Они наиболее успешны, когда работодатель обеспечивает им возможность проявлять сочувствие и заботу о коллегах и клиентах. \
Работодатель также должен быть готовым к тому, что они могут часто заботиться о том, \
чтобы успешно выполнять свою работу и иметь больше практического опыта в своей сфере.',

    title6: 'Как ставить задачи:',
    text6: '- Старайтесь давать задания, которые соответствуют их моральным ценностям и исследовательским интересам.\n\
- Дайте им возможность ознакомиться со всеми аспектами проекта.\n\
- Помогайте им раскрыть новые идеи, реализовывать их и давать обратную связь, чтобы они могли вернуться на правильный путь.\n\
Они обычно хорошо справляются с задачами, которые требуют глубокого понимания людей. \
Чтобы ставить задачи, работодатель должен давать им возможность работать с клиентами, \
проводить исследования и разрабатывать стратегии, чтобы удовлетворять требования клиентов.',

    title7: 'Чем мотивировать:',
    text7: '- Обратите внимание на их потребность в развитии своих талантов.\n\
- Значение работы более важно, чем денежное вознаграждение. Их работа должна иметь глубокий смысл и реальный исход.\n\
- Помните, что они могут быть малочувствительны к ежедневной рутинной работе, поэтому сделайте работу разнообразной и интересной.\n\
Они мотивируются, когда работодатель предоставляет им возможность проявлять свои лучшие качества. \
Они могут также находить мотивацию в работе с клиентами и оказание человеческой помощи. \
Чтобы их мотивировать, работодатель должен оценить их качества и давать им возможность выражать свои лучшие стороны.',

    title8: 'Как решать проблемы и избегать конфликтов:',
    text8: '- Уважайте их интуицию и чувства, их работа часто основана на чувственной составляющей.\n\
- Обратите внимание на их недовольство трудными конфликтами или несправедливостью.\n\
- Будьте открыты к диалогу, позвольте им выразить свои ощущения и предложить решения проблемы.\n\
Такие сотрудники могут быть достаточно чувствительными людьми, что может затруднять решение проблем и вредить отношениям с коллегами. \
Чтобы решить проблемы и избегать конфликтов с ними, работодатель должен быть готовым к противоречиям и понимать, \
что они стараются сохранить гармоничные отношения в коллективе. Работодатель должен понимать их личность и быть готовым к тому, \
чтобы решать проблемы ориентируясь на их эмоциональные потребности.',

    title9: 'Как развивать лидерские способности и управлять командой:',
    text9: '- Предоставьте им возможность вести дискуссии и обсуждения инициатив.\n\
- Старайтесь понимать их видение осуществления проекта и дайте им возможность это сделать.\n\
- Будьте готовы к обсуждению их концепций до того, как вы принимаете конечное решение для проекта.\n\
Как правило, они обладают высоким потенциалом для развития лидерских способностей, но часто они занимаются работой для других людей, \
а не для своей собственной карьеры. Чтобы развивать их лидерские способности, \
работодатель должен обеспечить возможности для руководства проектами и поддерживать их стремление к преодолению вызовов. \
Они должны получать положительные оценки за свои лидерские качества и получать возможности для развития своих лидерских навыков.\n\
\n\
Итак, работа с таким сотрудником может быть более эффективной, если работодатель понимает и учитывает их индивидуальную личность. \
Чтобы ставить задачи, мотивировать и решать проблемы, работодатель должен учитывать чувствительность \
и предоставлять им возможности для проявления их наилучших качеств. Развитие лидерских способностей можно достигнуть, \
обеспечивая им руководство проектами и возможности для развития их навыков в этой области.',
}

export const INTJ = {
    title1: 'Описание типа личности:',
    text1: 'Это логический и стратегический тип личности, \
который ориентирован на достижение целей и построение систем. \
Они обладают уникальной способностью видеть вещи далеко вперед \
и могут подойти для ролей, связанных с управлением, \
техническими науками и научными исследованиями. \
Могут оказаться ценным активом для компании благодаря своей аналитической и стратегической мысли.',

    title2: 'Сильные стороны:',
    text2: 'Логические и аналитические, \
они могут быстро и точно анализировать сложные ситуации. \
Они не боятся принимать решения и могут быстро оценить риски и возможности. \
Обладают высокими стандартами и ориентированы на качество во всех аспектах работы.',

    title3: 'Слабые стороны:',
    text3: 'Им может не хватать эмоциональной связи \
с окружающими и они могут слишком сосредоточиться на своих личных целях, \
упуская из виду проблемы других людей. Могут вырабатывать негативное отношение \
к критике и не учитывать мнения других. Иногда могут увлекаться деталями и перфекционизмом, \
что может затягивать работу и приводить к появлению отставания от графика.',

    title4: 'Подходящие профессии:',
    text4: 'Могут оказаться ценным активом в таких областях, \
как научные исследования, управление, консалтинг, технические науки и финансы. \
Эти профессии позволяют проявлять свои качества, такие как аналитический склад ума, \
стратегическое мышление и умение быстро принимать решения.',

    title5: 'Как работать с представителем данного типа личности:',
    text5: '- Будьте точными и конкретными в своих инструкциях.\n\
- Используйте эмпирические данные для обоснования своих позиций и идей, чтобы развить доверие.\n\
- Уважайте их личное пространство и не закидывайте их заданиями на последнюю минуту.\n\
Сотрудники с этим типом личности имеют выраженные логические способности и остроумие, \
они лучше работают, когда им доверяют принимать решения и принимать независимые решения. \
Они также ценят в работе эффективность, так что работодатель должен обеспечить комфортное рабочее окружение \
и определенные сроки избавления от стресса. Чтобы успешно работать с ними, \
менеджер должен давать им возможность проявить свои лучшие качества и учитывать их логический подход к работе.',

    title6: 'Как ставить задачи:',
    text6: '- Для них очень важно увидеть большую картину, поэтому старательно объясняйте, как задача соответствует общей цели.\n\
- Дайте им возможность самостоятельно решить, какие шаги нужно сделать на пути к выполнению задачи.\n\
- Проводите ежедневные встречи, чтобы они могли обновлять свой план действий и также сообщать о проблемах.\n\
Эти сотрудники высоко оценивают самостоятельность и организационные навыки. Они предпочитают выполнение работы, \
которая позволит им использовать свои логические и аналитические способности. Чтобы ставить задачи для них, \
работодатель должен обеспечить им работу, которая позволяет эффективно использовать свои лучшие качества, такие как исследования и анализ.',

    title7: 'Чем мотивировать:',
    text7: '- Сосредоточьтесь на интеллектуальных вызовах и проектах, которые способны расширить их знания и опыт.\n\
- Дайте им возможность поиска истины, чтобы они могли выявлять новые способы решения задач и найти свой интеллектуальный вызов в работе.\n\
- Оставайтесь проактивными в своих целях и достижениях, и поддерживайте их в этом.\n\
Такие сотрудники мотивируются, когда у них есть возможность работать самостоятельно и развивать свои логические способности. \
Они также оценивают, когда работодатель дает им свободу выбора и признает их лидерские способности. \
Чтобы их мотивировать, работодатель должен предоставить им возможности для творческой реализации своих знаний и умений \
и давать возможность оставаться лидером в своей области деятельности.',

    title8: 'Как решать проблемы и избегать конфликтов:',
    text8: '- Дайте им возможность предоставить свои идеи и решения проблем.\n\
- Уважайте их компетентность и позволяйте им принимать решения, как экспертам в своей области.\n\
- Избегайте конфронтации, вместо этого укажите на их знания и научите их найти компромиссы.\n\
Отличаются необычайной логичностью и способностью проникать в суть проблемы. \
Они могут быть склонны к отсутствию эмпатии и могут казаться слишком строгими в решении проблем. \
Чтобы решать проблемы и избегать конфликтов с ними, работодатель может обеспечить командную работу \
и быть открыт для их логичных идеальных решений, но также учитывать социальные аспекты проблемы и не забывать его социальную ответственность.',

    title9: 'Как развивать лидерские способности и управлять командой:',
    text9: '- Поддерживайте их самостоятельность при принятии решений.\n\
- Дайте им возможность контролировать время и производительность в рамках своих возможностей.\n\
- Создавайте моменты, когда они могут социализироваться и общаться с другими участниками команды, \
чтобы они могли выполнять задачи с более эффективностью.\n\
Данные сотрудники могут быть талантливыми лидерами, но, как правило, они не стремятся к лидерским позициям. \
Чтобы развивать лидерские способности, работодатель должен предоставлять им возможность руководить проектами и заполнять вакансии в таких позициях, \
где их логический подход будет востребован. Часто достижение лидерских позиций может требовать от них овладения социальными навыками и направленности на коммуникацию, \
таким образом, работодатель должен предоставить возможности для такого развития личности.\n\
\n\
Итак, работа с представителем данного типа личности может быть выполнена более эффективно, если работодатель предоставит им работу, \
которая позволит использовать их логические и аналитические способности. Четкое понимание интересов \
и индивидуальности этого типа сотрудника также поможет ставить задачи, мотивировать его, решать проблемы и избегать конфликтов. \
Развитие лидерских способностей можно достигнуть, предоставляя им индивидуальную поддержку и строя дружеские и доверительные отношения.',
}

export const ISTP = {
    title1: 'Описание типа личности:',
    text1: 'Это технический и практичный тип личности, \
который обладает уникальной способностью быстро адаптироваться \
к новым ситуациям и решать проблемы. Они могут подойти для ролей, \
связанных с инженерией, технологией и производством. \
Могут оказаться ценным активом для компании благодаря \
своей способности к рациональному мышлению и умению быстро решать проблемы.',

    title2: 'Сильные стороны:',
    text2: 'Обладают острым умом и способностью \
быстро решать практические задачи. Они хорошо адаптируются \
к изменяющимся ситуациям и могут эффективно работать в условиях высокого давления. \
Ориентированы на результат и умеют находить оптимальные решения для достижения целей.',

    title3: 'Слабые стороны:',
    text3: 'Могут быть недостаточно организованными и склонными к риску, \
что может приводить к некоторому беспорядку в работе. \
Их также может не хватать социальных навыков и они могут нуждаться в помощи в коммуникации с другими людьми. \
Могут иногда значительно затягивать принятие решений, что может отразиться на повседневной работе.',

    title4: 'Подходящие профессии:',
    text4: 'Могут оказаться ценным активом в таких областях, как производство, \
инженерия, технологии, авиация, строительство и очень подходят для профессий \
требующих быстрого реагирования на переменные и логичного мышления.',

    title5: 'Как работать с представителем данного типа личности:',
    text5: '- Будьте ясными и простыми в своих инструкциях.\n\
- Поощряйте использование практических решений и опыта.\n\
- Помогайте им сосредоточиться на сегодняшнем дне и выполнить текущие задачи.\n\
Представители данного типа личности любят работу, которая включает практические и физические действия, \
а не длительные теоретические дебаты. Они лучше действуют, чем говорят, и их навыки в механике и технике являются их крепкими сторонами. \
Работодатель должен обеспечить работу, которая позволяет им проявить свои практические навыки, например, \
предоставив задания по ремонту оборудования или по выполнению задач, требующих физической активности.',

    title6: 'Как ставить задачи:',
    text6: '- Дайте им возможность работать самостоятельно и не мешайте им, когда они погружаются в работу.\n\
- Старайтесь делать задания конкретными и реалистичными, чтобы они могли использовать свои навыки и знания.\n\
- Предоставляйте им возможность находить новые подходы к решению проблем.\n\
Любят конкретные задачи с минимальным количеством абстрактности. \
Они предпочитают действовать быстро и эффективно вместо того, чтобы тратить время на разговоры. \
Работодатель должен определить четкие цели и задачи для сотрудника, а также установить критерии успеха и ожидаемый результат. \
Это поможет избежать путаницы и неопределенности и обеспечит понимание того, что от них ждут.',

    title7: 'Чем мотивировать:',
    text7: '- Дайте им возможность выполнять поставленные задачи в своем собственном ритме.\n\
- Предоставьте им новые вызовы и возможности для использования своих навыков.\n\
- Будьте признательными за их усилия и результаты в своих работах.\n\
Часто мотивируются физическими и материальными стимулами, а также чувством достижения. \
Они также оценивают свою личную свободу и независимость в работе. \
Работодатель может стимулировать, предоставляя им возможность совершенствовать свои навыки и знания, \
а также установив высокие стандарты выполнения работы. \
Использование материальных стимулов, таких как повышения зарплаты или бонусы, также могут стимулировать их работу.',

    title8: 'Как решать проблемы и избегать конфликтов:',
    text8: '- Дайте им время на обдумывание и исследование проблем, прежде чем требовать быстрого решения.\n\
- Избегайте эмоциональных ситуаций, используйте факты и данные, чтобы помочь им принять решение.\n\
- Уважайте их личное пространство и не заставляйте их общаться, когда они не готовы.\n\
Склонны к тому, чтобы решать проблемы практическим путем, используя свой опыт и знания в области техники и механики. \
Они предпочитают, чтобы решение было основано на реальных данных и фактах, а не на эмоциональной реакции. \
Если возникают конфликты, обычно предпочитают отойти на задний план, но могут стать критичными, если они чувствуют, \
что их независимость или свобода были ограничены. Работодатель должен избегать эмоциональных или личных атак и предоставлять четкие \
и объективные данные для принятия решений.',

    title9: 'Как развивать лидерские способности и управлять командой:',
    text9: '- Дайте им возможность самостоятельно решать проблемы и принимать решения в рамках своих компетенций.\n\
- Обеспечьте им независимую работу и не контролируйте каждый шаг.\n\
- Создайте условия для проявления креативности и новаторства в их работе.\n\
Обычно не стремятся к лидерству, но они могут быть эффективными лидерами, \
если такая необходимость возникнет. Работодатель должен обеспечить такому сотруднику \
возможность улучшить свои коммуникативные и межличностные навыки, а также обобщенное понимание того, как работает компания. \
Добавление в их обязанности управление проектами или обучение новым сотрудникам также может помочь развитию лидерских способностей.\n\
\n\
В целом, работа с ними может быть выполнена более эффективно, если работодатель предоставит им возможность \
проявить свои практические навыки в работе и использует конкретные и детальные цели и задачи. \
Они могут быть мотивированы путем стимулирования их личной свободы и предоставления им возможности расти и развиваться. \
Использование четкой и объективной коммуникации и избежание эмоциональных реакций поможет избежать возможных конфликтов.',
}

export const ISFP = {
    title1: 'Описание типа личности:',
    text1: 'Это творческий и чувствительный тип личности, \
который обладает уникальной способностью работать с эмоциями \
и воплощать свою интуицию в жизнь. \
Они могут быть ценным активом для компаний, \
связанных с искусством, дизайном, модой, музыкой и другими творческими областями. \
Могут оказаться ценным активом для компаний благодаря своей способности к эмпатии и умению создавать красоту.',

    title2: 'Сильные стороны:',
    text2: 'Обладают креативным мышлением \
и способностью видеть мир своим уникальным образом. \
Они обладают чувством стиля и склонны к творческому проявлению себя. \
Довольно эмпатичны и могут понимать эмоции других людей, \
что позволяет им создавать уникальные и проникновенные произведения искусства.',

    title3: 'Слабые стороны:',
    text3: 'Иногда склонны к прокрастинации и отсутствию организации, \
что может повредить их результативности и производительности. \
Они могут также чувствительно воспринимать критику, \
что может приводить к неэффективной коммуникации на рабочем месте. \
Также могут нуждаться в некоторой степени направляющей поддержки \
и инструкциях, чтобы достичь лучших результатов.',

    title4: 'Подходящие профессии:',
    text4: 'Могут быть ценным активом в таких областях, \
как искусство, дизайн, мода, музыка, графический дизайн и другие творческие области. \
Они хорошо работают в группах, которые ценят креативность и интуицию.',

    title5: 'Как работать с представителем данного типа личности:',
    text5: '- Будьте дружелюбны и доверяйте им.\n\
- Учитывайте их чувства и переживания и старайтесь создавать для них комфортные условия работы.\n\
- Не ограничивайте их творческий потенциал.\n\
Сотрудники с таким типом личности имеют выраженные и хорошо развитые чувства и проявляют высокий уровень эмоциональной чувствительности. \
Их надежностей и упорство станут огромным преимуществом при выполнении любой работы, но это не означает, что они готовы выполнять многозадачность одновременно. \
Чтобы успешно работать с ними, менеджер должен предоставить им работу, которая позволяет эффективно использовать свои творческие и эмоциональные способности.',

    title6: 'Как ставить задачи:',
    text6: '- Дайте им возможность самостоятельно выбирать методы решения проблем.\n\
- Старайтесь делать задания интересными и вовлекающими.\n\
- Поощряйте их использовать свои навыки и таланты в работе.\n\
Умеют работать в критических ситуациях и ценят возможность работать в спокойной атмосфере. \
Хотя им может быть интересна уникальная, новая работа, они ненавидят скучную и унылую работу. \
Чтобы ставить задачи, работодатель должен осознавать их интересы и уважать их индивидуальность. Это поможет им выполнять работу более продуктивно и эффективно.',

    title7: 'Чем мотивировать:',
    text7: '- Поощряйте их личное развитие и стимулируйте их непрерывное обучение.\n\
- Используйте положительный подход и выражение признательности за их усилия и результаты.\n\
- Создайте в работе для них доступный для творчества простор.\n\
Такие сотрудники могут быть мотивированы, если работа связана с их интересами их миром искусства и творчества. \
Они также ценят, когда работодатель поддерживает их личные цели и национальные интересы. \
Чтобы мотивировать, работодатель должен предоставить им возможности для творческой реализации своих знаний и умений. \
Также важно предоставлять им свободу для воплощения своих идей в жизнь',

    title8: 'Как решать проблемы и избегать конфликтов:',
    text8: '- Не перегружайте их работой и не требуйте от них быстрого принятия решений.\n\
- Старайтесь избегать конфликтов и предоставлять им возможность выразить свое мнение и чувства.\n\
- Уважайте их личное пространство и дайте им время на переживание проблем.\n\
Очень чувствительны к эмоциям и негативной энергии. Они могут переживать и погружаться в свои эмоции, что может привести к неправильному пониманию важности цели. \
Чтобы решать проблемы и избегать конфликтов, работодатель должен обеспечить спокойную атмосферу на рабочем месте. \
Это поможет им чувствовать себя комфортно и раскрыть свои возможности.',

    title9: 'Как развивать лидерские способности и управлять командой:',
    text9: '- Поощряйте их лидерские способности, но не заставляйте их быть лидерами, если они не желают этого.\n\
- Создайте для них комфортные условия, в которых они могут выражать свою креативность и делиться своими идеями.\n\
- Убедитесь, что они понимают и поддерживают цели команды и обеспечьте им достаточную свободу веб-проектов.\n\
Часто избегают лидерских ролей из-за их страха оказаться в центре внимания. \
Однако, если доведется возглавлять проект, они могут быть очень эффективными и креативными. \
Чтобы развивать лидерские способности, работодатель должен строить с ними дружеские и доверительные отношения \
и обеспечить им индивидуальную поддержку и, в целом, предоставить им беспрепятственное поле деятельности.\n\
\n\
Итак, работа с представителем данного типа личности может быть выполнена более эффективно, если работодатель предоставит им работу, \
которая позволит использовать их творческие и эмоциональные способности. \
Четкое понимание интересов и индивидуальности этого типа сотрудника также поможет ставить задачи, мотивировать его, \
решать проблемы и избегать конфликтов. Развитие лидерских способностей можно достигнуть, \
предоставляя им индивидуальную поддержку и строя дружеские и доверительные отношения.',
}


export const INFP = {
    title1: 'Описание типа личности:',
    text1: 'Это идеалистичный и вдохновенный тип личности, \
который обладает уникальным чувством морали и справедливости. \
Они могут быть ценным активом для компаний, занимающихся социальными вопросами, \
образованием, искусством и другими областями, \
связанными с креативностью и эмоциональной глубиной. \
Могут оказаться ценным активом для компаний благодаря своей способности \
выражать эмоции и восхищаться красотой.',

    title2: 'Сильные стороны:',
    text2: 'Обладают уникальным чувством морали и справедливости, \
а также могут быть чувствительными к потребностям других людей. \
Они могут лучше понимать эмоции других людей и могут создавать уникальные \
и вдохновляющие произведения искусства. Обычно чувствительны и \
к своим эмоциям и могут являться хорошими дипломатами на рабочем месте.',

    title3: 'Слабые стороны:',
    text3: 'Могут быть слишком критичны к себе и своей работе, \
что может приводить к прокрастинации и отсутствию организации. \
Они могут быть склонны к принятию решений на основе эмоций, \
что может привести к неэффективным решениям на рабочем месте. \
Могут также нуждаться в большей ясности и структуре в заданиях, \
чтобы достичь лучших результатов.',

    title4: 'Подходящие профессии:',
    text4: 'Могут быть ценным активом в социальных вопросах, \
образовании, искусстве, культуре и других областях, которые ценят креативность и эмпатию. \
Они могут также хорошо работать в таких областях, как свободные искусства, \
литература, музыка и другие творческие области.',

    title5: 'Как работать с представителем данного типа личности:',
    text5: '- Будьте дружелюбны и поддерживайте их эмоциональное состояние и вдохновение.\n\
- Старайтесь создавать для них условия, в которых они могут свободно и творчески выражать свои идеи.\n\
- Проявляйте понимание и уважение к их индивидуальности и чувствительности.\n\
Часто заботятся о других людях, и они стремятся создать гармоничную атмосферу для работы. \
Они могут стать сильными идеалистами и мечтателями, которые привлекаются к работе, \
которая позволяет им проявлять свои творческие способности. \
Однако они могут чувствовать себя незащищенными перед критикой и осуждением. \
Чтобы работать с ними, старайтесь создавать спокойную атмосферу и признавать их индивидуальные качества. \
Дайте им время на размышление перед принятием решений и ставьте перед ними ясные цели.',

    title6: 'Как ставить задачи:',
    text6: '- Старайтесь понимать, что задачи должны имеют цель и смысл.\n\
- Давайте им возможность работать автономно и выбирать свой метод решения задач.\n\
- Разрешайте им выражать свои мысли и идеи, искать альтернативные решения и не ограничивайте их творческий потенциал.\n\
Они часто выделяются своей интроспективностью, креативностью и склонностью к глубоким размышлениям. \
Могут быть менее ориентированными на детали и более сосредоточены на общей картине. \
Чтобы помочь им справиться с задачами, старайтесь быть конкретнее в просьбах и давать им возможность работать в тихой обстановке. \
Кроме этого, убедитесь, что они видят значимость своей работы и ее ценности в контексте общих целей.',

    title7: 'Чем мотивировать:',
    text7: '- Оставляйте им место для творчества, поддержки и развития социума.\n\
- Старайтесь создавать для них условия работы, помогающие им ощущать свою значимость.\n\
- Поощряйте их развитие и обучение.\n\
Они стремятся к гармонии и покое, и могут запинаться, когда работа требует дисциплины или фокусировки на деталях. \
Чтобы мотивировать, старайтесь убедить их в том, что их работа ценна и она важна для общих целей. \
Признавайте их индивидуальные качества, особенно их креативность и чувствительность.',

    title8: 'Как решать проблемы и избегать конфликтов:',
    text8: '- Старайтесь давать им достаточно времени на изучение информации и анализ ситуации для принятия взвешенного, чувствительного решения.\n\
- Уважайте их чувства и мнение, дайте им возможность высказаться и проявлять свою эмпатию.\n\
- Стремитесь избегать конфликтов, концентрируясь на общем благе и достигаемых результатах.\n\
Могут быть восприимчивы к критике, особенно когда она оскорбляет их эмоциональное состояние. \
Чтобы решать проблемы, старайтесь их услышать и общайтесь с ними в частном порядке, чтобы убедиться, что их потребности удовлетворены. \
Уважайте их чувства и избегайте конфликтов, если это возможно.',

    title9: 'Как развивать лидерские способности и управлять командой:',
    text9: '- Помогайте им найти свои лидерские качества и развивать их, причем без насильственного давления.\n\
- Создавайте для них возможности для творческого самовыражения и продолжайте вырабатывать навыки руководства и организации.\n\
- Разрешайте им делиться своими идеями и мнениями, цените их работу и обратите внимание на их статьи на блогах и сообществах.\n\
Могут иметь выдающиеся качества лидерства, такие как чувствительность, творческие способности и способность к интуиции. \
Чтобы развивать их лидерские способности, создайте поддерживающую среду, которая позволяет им использовать свои качества. \
Установите ясные планы и цели, чтобы они могли видеть, как их работа относится к общим целям. \
Однако помните, что они могут страдать из-за жесткой дисциплины, поэтому старайтесь быть мягче и уважительнее, \
когда вы работаете над развитием их лидерских способностей. \n\
\n\
В целом, ключевым моментом при работе с данным типом личности является понимание их уникальности и индивидуальности. \
Дайте им время на размышление и помогайте им принимать решения. \
Старайтесь создавать дружественную и поддерживающую атмосферу, чтобы они могли проявлять свои таланты и быть успешными в своем труде.',
}


export const INTP = {
    title1: 'Описание типа личности:',
    text1: 'Это аналитический и интеллектуальный тип личности, \
который может стать ценным активом для компаний, занимающихся наукой, \
технологией, инновациями и другими областями, требующими глубокой аналитики и логического мышления. \
Могут помочь компаниям в поиске новых идей \
и разработке инновационных проектов благодаря \
своей способности анализировать информацию и получать новые знания.',

    title2: 'Сильные стороны:',
    text2: 'Обладают уникальной способностью анализировать \
и обрабатывать информацию, а также могут отличаться своими логическим \
и критическим мышлением. Они часто способны находить новые идеи и решения для сложных проблем, \
а также могут хорошо работать в напряженных ситуациях. \
Обычно ценят свою независимость и могут хорошо работать самостоятельно.',

    title3: 'Слабые стороны:',
    text3: 'Могут быть склонны к анализу и переработке информации до бесконечности, \
что может вести к прокрастинации и отсутствию организации. \
Они могут также быть несколько социально неуклюжими и иметь трудности \
в коммуникации с другими людьми. Также могут нуждаться в большей мотивации \
и стимуле, чтобы достигать лучших результатов.',

    title4: 'Подходящие профессии:',
    text4: 'Могут быть ценным активом в таких областях, \
как наука, технология, инновации, инженерия и другие области, \
где требуется скрупулезная аналитика и логическое мышление. \
Они могут также хорошо работать в таких областях, как компьютерные науки, математика, \
статистика и другие области, требующие глубокой экспертизы и знаний.',

    title5: 'Как работать с представителем данного типа личности:',
    text5: '- Дайте им возможность работать над своими проектами и исследованиями для достижения лучших результатов.\n\
- Старайтесь создавать для них условия, в которых они могут свободно выражать свои идеи и заниматься любимым делом.\n\
- Разрешайте им работать автономно и не контролировать каждое их действие.\n\
Это люди, которые думают и анализируют много. Чтобы работать с ними, старайтесь общаться с ними четко, понятно и предоставлять им информацию сразу в печатном виде. \
Они склонны к самостоятельному решению задач, но они также любят обсуждать свои идеи и дают ценные предложения. \
Старайтесь вовлекать их в дискуссии и прислушиваться к их мнению.',

    title6: 'Как ставить задачи:',
    text6: '- Задачи должны быть понятны и иметь конкретный результат.\n\
- Старайтесь избегать жестких сроков и дать возможность работать в своем темпе.\n\
- Разрешайте их интеллектуальной любознательности и уважайте их желание изучать новые области науки.\n\
Нередко имеют трудности с принятием решений, особенно когда речь идет о конкретных планах и деталях. \
Чтобы ставить задачи, старайтесь быть ясными и конкретными в своих требованиях, выдавайте им требуемый объем работы и цели. \
Старайтесь избегать негативных комментариев к их идеям, но спросите их мнение, когда начинаете работать над проектом.',

    title7: 'Чем мотивировать:',
    text7: '- Уважайте их интеллектуальные возможности и цените их разносторонние интересы.\n\
- Давайте им возможность совершенствоваться и изучать новое.\n\
- Поощряйте их креативность и возможность свободно выражаться.\n\
Часто нуждаются в поощрении и поддержке со стороны своих работодателей, чтобы поддержать их мотивацию. \
Если они уверены в ценности своей работы, они могут быть очень мотивированными и целеустремленными. \
Старайтесь давать им возможность инновировать, давать свободу при создании их собственных идей. \
Проявляйте интерес к их работе и показывайте свое уважение к их личности.',

    title8: 'Как решать проблемы и избегать конфликтов:',
    text8: '- Старайтесь давать им время для обдумывания проблем и поиска оптимального решения.\n\
- Оставайтесь терпеливыми и демонстрируйте свою уверенность в их интеллектуальных способностях.\n\
- Избегайте давления или конфронтации, попробуйте найти компромисс или общую землю.\
Могут быть настраивающимися на конфликты, когда их идеи и решения не получают должного одобрения или когда они чувствуют себя непонятными. \
Чтобы решать проблемы, старайтесь быть объективным и справедливым в своей оценке их работы и мнений. \
Убедитесь, что вы даете им регулярную обратную связь и понимаете их точку зрения. \
При решении конфликтов старайтесь быть дипломатичным, анализировать факты и аргументы, а не эмоции.',

    title9: 'Как развивать лидерские способности и управлять командой:',
    text9: '- Старайтесь помочь им найти свои лидерские качества и развивать их.\n\
- Разрешайте им принимать решения и руководить, ставьте цели и оставляйте им свободу выбора маршрута достижения этих целей.\n\
- Создавайте условия для творческой работы, доверяя им научные и исследовательские проекты и поощряя их личное развитие.\n\
Могут быть хорошими лидерами, но они могут не всегда стремиться к этой роли. \
Если вы хотите развивать лидерские способности, старайтесь создавать среду, где они чувствуют себя комфортно и могут развивать свои идеи. \
Уважайте их точку зрения и стимулируйте их руководительские качества. \
Иногда они склонны к изоляции и беследовому уходу, поэтому старайтесь поддерживать деловые отношения с ними, \
давайте им обратную связь и покажите им ценность их работы для компании.\n\
\n\
В целом, работа с представителями этого типа может быть эффективной, если вы понимаете их уникальность как личности и те принципы, \
которые индивидуальны для данного типа. Чтобы работать с ними, необходимо быть четким и понятным в своих запросах, \
давать свободу творческого подхода и уважительно относиться к их мнению. Старайтесь избегать конфликтов и поддерживать ценность их работы в компании, \
чтобы они могли почувствовать себя комфортно и достичь максимального результата в работе.',
}


export const ESTP = {
    title1: 'Описание типа личности:',
    text1: 'Это энергичный и действенный тип личности, \
который может стать ценным активом для компаний, \
занимающихся бизнесом, маркетингом, продажами и другими областями, \
которые требуют быстрого принятия решений и эффективного взаимодействия с людьми. \
Они могут помочь компаниям в установлении контактов с новыми клиентами \
и увеличении продаж благодаря своей спонтанности и открытости.',

    title2: 'Сильные стороны:',
    text2: 'Обладают высокой энергией и мастерством во взаимодействии с людьми. \
Они обычно способны легко и быстро адаптироваться к новым ситуациям и быстро принимать решения. \
Отличаются своей активностью и инициативностью, \
что позволяет им легко находить новые возможности и развивать бизнес.',

    title3: 'Слабые стороны:',
    text3: 'Могут быть несколько нерешительными в долгосрочном планировании \
и стратегическом мышлении. Им может не хватать терпения и упорства, \
чтобы достичь долгосрочных целей. Также они могут быть склонны к рискованным решениям \
и чрезмерной уверенности в себе, что может приводить к проблемам.',

    title4: 'Подходящие профессии:',
    text4: 'Могут быть ценным активом в таких областях, как бизнес, \
маркетинг, продажи и другие области, требующие быстрого принятия решений \
и эффективного взаимодействия с людьми. Они могут также хорошо работать в таких областях, \
как спорт, развлечения, гостиничный бизнес и др.',

    title5: 'Как работать с представителями данного типа личности:',
    text5: '- Быть конкретным и четким в своих указаниях и инструкциях, так как они предпочитают действовать, а не думать.\n\
- Дать им возможность работать в креативной обстановке и разнообразить их рабочий день, чтобы они не скучали и не теряли интерес.\n\
- Быть готовым к общению и принимать участие в их играх и шутках.\n\
Это люди, которые склонны к решению проблем и реализации идей через действия. \
Чтобы работать с ними, старайтесь предоставить им ясные инструкции и руководство в их работе. \
Представители данного типа личности - люди, которые могут принимать решения быстро, поэтому им может потребоваться помощь для выработки оптимального решения. \
Эффективное общение - это отличный способ сотрудничества с ними.',

    title6: 'Как ставить задачи:',
    text6: '- Предоставлять задачи, которые требуют быстрого принятия решений и сочетают в себе физическую и эмоциональную активность.\n\
- Объяснять задачу не только словами, но и демонстрировать ее на практике.\n\
- Давать возможность сотрудничать и соревноваться, так как они любят конкуренцию.\n\
Отлично справляются с задачами, требующими навыков практического подхода и импровизации. \
Чтобы ставить задачи, старайтесь обеспечить их возможностью практиковать и выполнять задачи без избыточной информации. \
Это люди, которые любят действовать, поэтому давайте им возможность действовать свободно и создавать идейные концепции, \
которые будут выполнены в течение кратчайшего времени.',

    title7: 'Чем мотивировать:',
    text7: '- Предоставлять им возможность проявить свои лидерские способности и получить узнаваемость при выполнении задач.\n\
- Оценивать их результаты и успехи, особенно в присутствии других.\n\
- Предоставлять им возможность работать с разнообразными задачами и проектами.\n\
Это люди, которые мотивируются быстрыми результатами. Они могут быть склонны работать над более крупными проектами, \
если видят, что результаты их труда будут проявляться в ближайшие несколько дней или недель. \
Старайтесь создавать возможности для них, чтобы они могли находить новые задания и занятости, \
которые могут укрепить результат их работы, давайте возможность им быть ответственными за решение актуальных вопросов. \
Лучший грамотный подход в мотивации - это поощрять их стиль работы и прямолинейный подход.',

    title8: 'Как решать проблемы и избегать конфликтов:',
    text8: '- Быть готовым к конструктивным дебатам и предоставлять им возможность выражать свое мнение.\n\
- Не использовать критику, а давать им поддержку и позитивные рекомендации.\n\
- Не давать время на принятие решения, так как они предпочитают действовать быстро и без раздумий.\n\
Склонны к принятию быстрых решений, что может привести к конфликтам. \
Чтобы решать проблемы, старайтесь обеспечивать им возможность вырабатывать решения на основе детального анализа ситуации, \
предоставляйте информацию по мере ее получения. При подходе к конфликтам, старайтесь использовать дипломатические методы и решать \
проблемы при помощи конструктивного общения.',

    title9: 'Как развивать лидерские способности и управлять командой:',
    text9: '- Давать им возможность принимать ответственность за проекты и задачи.\n\
- Предоставлять им автономию в принятии решений и управлении своим временем.\n\
- При поддержке и стимулировании их идей, позволить им проявить свои возможности и управлять командой.\n\
Это люди, которым нравится быть в центре внимания. Они могут быть хорошими лидерами, если имеют возможности проявить свои лидерские качества. \
Если вы хотите развивать лидерские способности, старайтесь давать им возможности управлять проектами и командами, \
обеспечивайте своевременную обратную связь и делайте акценты на их сильные стороны. \
Давайте им возможность работать в качестве лидеров на заданиях с наградой, которые позволяют им проявить себя в управлении.\n\
\n\
В целом, работа с представителями данного типа может быть эффективной, если вы понимаете их особенности как личности и принципы, \
которые индивидуально для данного типа. Чтобы работать с ними, старайтесь давать им ясные задачи и обратную связь, \
давайте возможности для практических и эмоциональных способностей и избегайте конфликтов. \
Если вы нацелены на их развитие, старайтесь создать среду, где они чувствуют себя комфортно и могут проявить свои лидерские качества в управлении проектами и командами.',
}


export const ESFP = {
    title1: 'Описание типа личности:',
    text1: 'Это жизнерадостный и эмоциональный тип личности, \
который может стать ценным активом для компаний, занимающихся бизнесом, \
маркетингом, продажами и другими областями, которые требуют внимательности \
к клиентам и развития связей. Могут помочь компаниям в привлечении новых \
клиентов и укреплении имиджа благодаря своей общительности и энтузиазму.',

    title2: 'Сильные стороны:',
    text2: 'Обладают высоким чувством юмора, теплой натурой \
и легкостью в общении с людьми. Они имеют отличные навыки в межличностных отношениях \
и могут быстро наладить связи с новыми людьми. Также обладают энергией и оптимизмом, \
что может помочь им в нахождении новых возможностей и создании выгодных условий для бизнеса.',

    title3: 'Слабые стороны:',
    text3: 'Могут быть иногда не такими организованными и системными, \
как это требуется для выполнения более рутинных задач. Они могут также проявлять \
излишнюю чувствительность к критике и критику, что может затруднять достижение целей. \
Могут иногда быть несколько склонны к переключению между различными проектами, \
что может приводить к недостатку фокуса и концентрации.',

    title4: 'Подходящие профессии:',
    text4: 'Могут быть ценным активом в таких областях, как бизнес, \
маркетинг, продажи, гостеприимство и другие области, которые требуют внимания к \
клиентам и межличностным отношениям. Они могут также хорошо работать в культурных индустриях, \
таких как музыка, театр и искусство.',

    title5: 'Как работать с представителем данного типа личности:',
    text5: '- Быть доступным и дружелюбным в общении, так как они предпочитают работу в приятной обстановке.\n\
- Проявлять понимание и уважение к их эмоциональным потребностям.\n\
- Обеспечивать коммуникацию и общение с другими коллегами, так как они очень контактны и общительны.\n\
Это люди, которые очень социальны и эмоциональны, и нацелены на общение с другими людьми. Чтобы работать с ними, \
старайтесь поддерживать открытый и демократичный подход в общении и выражении своих мыслей и идей. \
Это поможет им чувствовать себя взаимоуважаемыми и частью команды.',

    title6: 'Как ставить задачи:',
    text6: '- Давать разнообразные задачи, которые потребуют физической активности и социального взаимодействия.\n\
- Обеспечить им возможность творческого воплощения своих идей.\n\
- Помочь определить, как задача соотносится с их общими целями и интересами.\n\
Это человек, который лучше всего работает над задачами, которые связаны с людьми и могут сделать положительный вклад в их жизнь. \
Старайтесь ставить ему задачи, которые требуют навыков в общении и социальной компетенции. \
Для него важно иметь понимание цели своего труда и его полезности, поэтому старайтесь давать конкретные примеры того, как его работа может влиять на жизнь людей.',

    title7: 'Чем мотивировать:',
    text7: '- Показывать признание за их энергию и творческие успехи.\n\
- Предоставлять возможность работать с разнообразными задачами и проектами.\n\
- Давать им возможность общаться и работать в команде.\n\
Мотивируется возможностью улучшить свои личные навыки и быть признанным за свои успехи. \
Старайтесь давать ему возможность расти и развиваться, присваивая ему более сложные задачи, \
связанные с социальными взаимодействиями, и обращайте внимание на его успехи и достижения. \
Это поможет ему чувствовать себя ценным членом команды и продолжать работу на новых высотах.',

    title8: 'Как решать проблемы и избегать конфликтов:',
    text8: '- Не подавлять их эмоции и чувства, а учитывать их мнения и взгляды.\n\
- Предоставить время для решения конфликта и для выражения своих чувств.\n\
- Искать компромисс, который удовлетворит все стороны.\n\
Предпочитает избегать конфликтов, но может принимать решения на основе эмоций и переживаний. \
Чтобы решать проблемы с ним, используйте демократический подход и старайтесь объяснить свою точку зрения \
и обеспечить возможности для диалога и дискуссии. Для избегания конфликтов, старайтесь давать конструктивную критику и обсуждать проблемы в мирном режиме.',

    title9: 'Как развивать лидерские способности и управлять командой:',
    text9: '- Определить в команде роль в соответствии с их индивидуальными способностями и интересами.\n\
- Давать им возможность работать в своем темпе и рисковать, чтобы достичь успеха.\n\
- Помочь им стать лидером, предоставив гибкость, необходимую для того, чтобы вернуться в команду.\n\
Имеет хорошие социальные навыки и может легко общаться с другими людьми. \
Он может стать эффективным лидером, если будет развивать социальные и коммуникативные способности. \
Для развития лидерских способностей, старайтесь поддерживать его инициативы и давать ему возможность управлять малыми группами людей и командами. \
Важно помнить, что эффективный подход к развитию лидерских качеств должен быть связан с мотивацией и признанием его достижений.\n\
\n\
В целом, работа с данным типом может быть эффективной, если вы понимаете особенности его личности и принимаете \
необходимые меры для обеспечения оптимальных условий работы, мотивации и развития. \
Чтобы работать с ними, старайтесь продемонстрировать открытость и взаимоуважение в общении, \
ставьте задачи, которые связаны с социальными взаимодействиями, используйте демократический подход, \
когда столкнулись с проблемами, и давайте возможность расти и развиваться, обеспечивая мотивацию и признание достижений.',
}


export const ENFP = {
    title1: 'Описание типа личности:',
    text1: 'Это креативный и вдохновленный тип личности, \
который может стать ценным активом для компаний, \
занимающихся маркетингом, рекламой, социальными медиа \
и другими областями, которые требуют воображения и новаторства. \
Они могут помочь компаниям в развитии новых идей и творческом подходе к проблемам.',

    title2: 'Сильные стороны:',
    text2: 'Обладают творческим мышлением, \
энергией и оптимизмом, что может помочь им в нахождении новых решений \
и создании выгодных условий для бизнеса. Они могут быть отличными коммуникаторами, \
что позволяет им находить общий язык с людьми из разных сфер \
и устанавливать продуктивные рабочие отношения.',

    title3: 'Слабые стороны:',
    text3: 'Могут иногда склоняться к проявлению некоторой непостоянности \
и неустойчивости в работе, особенно если им не удастся увлечься проектом. \
Они могут также проявлять излишнюю эмоциональность в работе и могут терять концентрацию в долгосрочных задачах.',

    title4: 'Подходящие профессии:',
    text4: 'Могут быть ценным активом в таких областях, \
как маркетинг, реклама, социальные медиа, образование, визуальные искусства \
и другие области, которые требуют креативности и инновационного подхода к работе.',

    title5: 'Как работать с представителем данного типа личности:',
    text5: '- Быть доступным для общения и выслушивания их идей и мнений.\n\
- Предоставлять им свободу в творческом процессе и при работе в команде.\n\
- Помогать им создавать прочные связи с коллегами и устанавливать профессиональные контакты.\n\
Обладает высоким уровнем социальной и эмоциональной интеллектуальности, \
поэтому имеются все шансы схватываться со сложными обстановками. \
Он обычно приветствуют разнообразие и пытаются найти новые идеи. \
Вот почему ему нужна возможность работать в условиях, позволяющих ему свободно выражать свой творческий потенциал. \
Лучше всего работать с ним открыто и демократично, давать возможность вести полезные дискуссии и исследовать разнообразные задачи.',

    title6: 'Как ставить задачи:',
    text6: '- Предоставлять задачи, позволяющие реализовать личностные возможности.\n\
- Предоставлять условия для творческого роста.\n\
- Помогать определить ценность и смысл задачи, чтобы они могли лучше сосредоточиться на работе.\n\
Обожает использовать свои творческие и инновационные способности, чтобы решать сложные проблемы. \
Он любит пробовать новые идеи и создавать новые продукты. Каждый случай уникален, поэтому лучше всего давать ему задачи, \
которые требуют инновационного и творческого подхода. Используйте мотивирование, поощряйте их схватки с новыми идеями, и помните, \
что они имеют предпочтения по интересным задачам, связанным с развитием, обучением и изучением новых специальностей.',

    title7: 'Чем мотивировать:',
    text7: '- Показывать признание за творческие успехи и достижения целей.\n\
- Сохранять сильную мотивацию, предоставляя множество новых задач и проектов.\n\
- Организовывать возможность коммуникации и дружеского взаимодействия с коллегами.\n\
Это человек, который ведет движение вперед, к еще более сильному и осознаваемому росту. \
Они любят быть уважаемыми и признанными за свои достижения, и проявляют интерес к новым проектам и идеям. \
Чтобы мотивировать, относитесь к ним с уважением, задавайте интересные вопросы, и заставьте их самих оценить результаты своей работы. \
Не забывайте про поощрения в их направлении, будьте честными и заинтересованными.',

    title8: 'Как решать проблемы и избегать конфликтов:',
    text8: '- Быть чутким и выслушивать точки зрения, чтобы избежать возможных конфликтов в социальных ситуациях.\n\
- Помогайте определить, какие задачи стоят их перед коллегами, чтобы они могли оптимально участвовать в процессе.\n\
- Сосредоточиться на социальных отношениях и типе коммуникации, которые они предпочитают.\n\
Могут иметь эмоциональную нагрузку и не всегда видят полную картину в сложных ситуациях, \
поэтому лучше всего обращаться к ним в их формальном рассудке, обсуждая сложности и проблемы, которые могут возникнуть. \
Когда решится избегать конфликтов с ним, владейте своей позицией и раскройте все карты, но объясняйте любые проблемы и угрозы нейтрализации, \
вместо того, чтобы впадать в гнев и тяжелые слова. Обращайтесь с особой осторожностью и чувствительностью, и оценивайте их личный опыт.',

    title9: 'Как развивать лидерские способности и управлять командой:',
    text9: '- Давайте колоссальную привлекательность и возможность выводить оригинальные идеи других членов команды, при этом поддерживая "интерес за работу".\n\
- Активно участвуйте в креативных процессах помогайте им развивать свои лидерские качества.\n\
- Давайте возможность команде эффективно сотрудничать и мотивироваться.\n\
Обладает отличными способностями в области социальной и коммуникативной интеллектуальности \
и может быстро адаптироваться к любым условиям. Чтобы развивать в них лидерские способности, \
давайте им возможность управлять небольшими группами людей или командами, включая проекты, которые заинтересованы в общественных проявлениях. \
Лучше всего стимулировать их креативность, путем награждения за инновации, а также помогать им справиться с профессиональными проблемами, \
которые могут возникнуть, путем помощи и менторства.\n\
\n\
В целом, работа с представителем данного типа может быть эффективной, \
если вы будете понимать особенности их личности и принимать меры к обеспечению оптимальных условий работы, мотивации и развития. \
Чтобы работать с ними, старайтесь поддерживать открытость и общение, выдавайте задачи, которые подстёгивают творческий и креативный подход, \
избегайте конфликтов, обращайте внимание и помогайте развивать лидерские способности.',
}


export const ENTP = {
    title1: 'Описание типа личности:',
    text1: 'Это тип личности с развитым интеллектом и аналитическим мышлением. \
Они могут быть ценным активом для компаний, занимающихся консалтингом, исследованиями, \
разработкой продуктов и других областей, которые требуют инновационного и рационального подхода.',

    title2: 'Сильные стороны:',
    text2: 'Обычно обладают развитой интуицией и энергией, \
что позволяет им быстро анализировать сложные проблемы и находить эффективные решения. \
Они могут быть отличными коммуникаторами и аргументаторами, \
что позволяет им убеждать и вдохновлять других людей.',

    title3: 'Слабые стороны:',
    text3: 'Могут быть склонны к проявлению некоторой непостоянности \
и неорганизованности в работе, особенно если им не удастся заинтересоваться проектом. \
Они могут также проявлять излишнюю агрессивность и нетерпимость к другим людям.',

    title4: 'Подходящие профессии:',
    text4: 'Могут быть ценным активом в таких областях, как консалтинг, \
исследования, разработка продуктов, IT, маркетинг и другие области, \
которые требуют инновационного и рационального подхода к работе.',

    title5: 'Как работать с представителем данного типа личности:',
    text5: '- Быть готовым к прямым дискуссиям и диалогам и не считать это конфликтом.\n\
- Предоставлять объективную обратную связь и возможность участвовать в процессе принятия решений.\n\
- Уверенность и доверие в их способности.\n\
Любят вызовы и новые задачи, которые могут спровоцировать свой творческий потенциал. \
Они быстро адаптируются к изменяющимся условиям и могут быстро приспособиться к новым ситуациям. \
Лучше всего работать с ними в условиях открытости, свободного общения и коммуникационной прозрачности. \
Эти люди хотят понимать, как они оказываются в своем мире и как их достижения могут быть использованы для общего блага. \
Используйте прямые и ясные инструкции, но не забывайте давать им свободу для проявления творчества и приложения усилий.',

    title6: 'Как ставить задачи:',
    text6: '- Предоставлять интересные, сложные и многогранные задачи.\n\
- Предоставлять возможность для творческих решений и новых идей.\n\
- Работать над практическими и реалистичными целями.\n\
Обладает уникальной способностью к анализу и креативности, что делает их идеальным выбором для решения новых проблем и поиска новых решений. \
Лучше всего ставить задачи, которые требуют креативного подхода и нестандартных решений. Конечно, они также могут работать с обычными задачами, \
но они могут становиться неинтересными, если не предоставляют достаточной степени новизны. Дайте им возможность реализовать свои творческие способности, \
задавая вопросы, подставляя новые методы, и не ограничивайте их доступ к инновационным задачам.',

    title7: 'Чем мотивировать:',
    text7: '- Предоставлять работу с интересными задачами и проектами.\n\
- Помогать им видеть вклад своей работы в амбициозные и важные проекты.\n\
- Предоставлять гибкое место работы, чтобы они могли удовлетворять свои требования и запросы в процессе работы.\n\
Любят вызовы, могут применять свои таланты и направлены на создание новых решений. \
Для того, чтобы они были мотивированы, работодатель должен предоставлять им интересные задачи и стимулировать их креативность. \
Эти люди должны чувствовать, что их работа оценивается и признается, и что они играют важную роль в успешности компании. \
Для того, чтобы мотивировать, предоставляйте им возможность изучать иностранные направления, участвовать в проектах и совершенствоваться в своих навыках.',

    title8: 'Как решать проблемы и избегать конфликтов:',
    text8: '- Быть готовым к дискуссиям и обратной связи.\n\
- Понимать, что они могут отстаивать свою точку зрения и быть решительными в принятии решений.\n\
- Поддерживать конструктивное обсуждение и признание аргументации, используемой ими.\n\
Они любят обсуждать идеи и вносить изменения в работу, чтобы улучшить результаты. Вместе с тем, они могут стать непреклонными, если их взгляды неимоверно важны. \
Лучше всего решать проблемы и избегать конфликтов с ними, используя открытый и прямой подход. Объясняйте свою позицию, тщательно слушайте их аргументы. \
Используйте логические и законодательные доводы, а также равенство и уважение, говоря о проблемах, которые заставляют их испытывать сильные эмоции.',

    title9: 'Как развивать лидерские способности и управлять командой:',
    text9: '- Предоставлять возможность для руководства и принятия решений на высоком уровне.\n\
- Предоставлять материал для улучшения и развития лидерских качеств.\n\
- Обеспечить их членами команды, которые могут эффективно работать вместе с ними и помогать им достигать результатов.\n\
Обычно обладают высоким уровнем социальной интеллектуальности и природной способностью сообщать свои мысли и идеи, благодаря своему креативному мышлению. \
Чтобы развивать лидерские способности, дайте им возможность принимать участие в проектах, которые позволяют использовать их таланты и навыки лидерства. \
Убедитесь в том, что работодатель оценивает и признает их достижения, а также помогает создавать условия, \
в которых они могут продолжать развиваться и раскрывать свой творческий потенциал.\n\
\n\
В целом, работа с представителем этого типа личности может быть построена на основе партнерства, сочетая в себе поддержку, \
стимулирование и общение, для того, чтобы обеспечить оптимальный рост и развитие. \
Чтобы работать с ними, учитывайте их склонности, ставьте задачи, которые требуют творческого решения, \
на общих грани-рассматривайте варианты решения возникающих проблем, мотивируйте их, каким-то образом, и развивайте лидерские способности.',
}


export const ESTJ = {
    title1: 'Описание типа личности:',
    text1: 'Это тип личности с организованным и практичным подходом к работе. \
Они могут быть ценным активом для компаний, занимающихся управлением, производством, \
бухгалтерией и другими областями, которые требуют тщательного планирования \
и эффективного управления ресурсами.',

    title2: 'Сильные стороны:',
    text2: 'Обычно обладают высоким уровнем ответственности и усердия. \
Они предпочитают работать в ясно определенных структурах и процессах, \
что позволяет им быть более продуктивными.Могут также быть отличными лидерами, \
которые способны мотивировать и организовывать других людей.',

    title3: 'Слабые стороны:',
    text3: 'Могут быть склонны к консервативному и органиченному мышлению, \
а также к недостаточному вниманию новым идеям и методам работы. \
Они могут также проявлять излишнюю жесткость и категоричность в процессе принятия решений.',

    title4: 'Подходящие профессии:',
    text4: 'Могут быть ценным активом в таких областях, \
как управление, производство, бухгалтерия, юриспруденция, медицина \
и другие области, которые требуют тщательного планирования и эффективного управления ресурсами.',

    title5: 'Как работать с представителем данного типа личности:',
    text5: '- Быть четким и конкретным в инструкциях и описании работы.\n\
- Следовать правилам и стандартам, установленным в организации.\n\
- Предоставить структурированную и организованную среду работы.\n\
Это люди, которые ценят точность, ответственность и открытое общение. Они ожидают точных указаний, четкой структуры и уважительного отношения со стороны работодателя. Лучше всего работать с ними через открытое общение, чтобы уточнить пункты работ и дать им конкретные цели. Делегирование работ доносите в форме четких инструкций, определенных сроков выполнения и контроля, а также учитывайте их точный, позитивный и ответственный характер на рабочем месте.',

    title6: 'Как ставить задачи:',
    text6: '- Давать четкие и ясные инструкции и привязывать их к серьезным целям.\n\
- Предоставлять возможность использовать свою системность и упорядоченность в работе.\n\
- Указывать на конечный результат работы и четко определять сложность задачи.\n\
Обычно предпочитают установленную структуру и четкие наметки при выполнении работ. Лучше всего ставить задачи через объяснение своего ожидания от их работы, поставляя достаточно информации и возможностей для проявления своих навыков. Используйте ясные инструкции, формальный подход и обеспечивайте постоянный контроль своими словами и действиями, чтобы избежать недоразумений и неприветливой атмосферы на рабочем месте.',

    title7: 'Чем мотивировать:',
    text7: '- Поощрять выполнение стандартов и производительности, а также обратную связь.\n\
- Поддерживать четкую линию деятельности и последовательность в работе.\n\
- Предоставлять возможность брать на себя ответственность.\n\
Они работают в условиях организованных, четко структурированных, им необходимо приложить усилия, чтобы сохранять свой порядок и поддерживать производительность. Для того, чтобы мотивировать, предоставляйте им конкретные и мотивирующие цели, позволяющие им использовать все свои навыки и ресурсы. Любят планирование и уверены в достижении своих целей, если ставят цели на продуктивность, то обеспечивая достаточный контроль и награду за выполнение работы, в соответствии с его ожиданием.',

    title8: 'Как решать проблемы и избегать конфликтов:',
    text8: '- Не допускать нечеткости и недостатка информации при решении проблем.\n\
- Предоставлять определенность решения и возможное воздействие на действия в будущем.\n\
- Поддерживать процесс, который необходим им для принятия решения.\n\
Структурированные и логически мыслящие люди, потому конфликты могут возникать в результате разных точек зрения и отношению к работе. Лучше всего решать проблемы и избегать конфликтов с ними, используя открытый и четкий подход, предъявлять лучшие варианты, делая обоснованные предложения и рекомендации на основе имеющихся фактов. Это может помочь избежать множества разногласий и межличностных проблем на рабочем месте.',

    title9: 'Как развивать лидерские способности и управлять командой:',
    text9: '- Давать возможность работать в зоне комфорта, т.е. устанавливать контроль и надзор.\n\
- Разрабатывать четкие стандарты и ожидания от команды, которые они могут привнести в работу.\n\
- Определять роли и задачи каждого члена команды, чтобы обеспечить четкий и определенный процесс работы.\n\
Отлично подходят для роли лидера и способны управлять действиями группы людей. Чтобы развивать лидерские способности, предоставляйте им возможность совершенствовать свои навыки, участвовать в управлении проектами и обучиться лидерским навыкам. Действуйте с уделяющим временем обсуждению конкретных инструкций, а также создавайте условия, в которых они могут почувствовать себя комфортно и обладать всеми необходимыми ресурсами для достижения целей.\n\
\n\
В целом, работа с представителем данного типа личности может быть построена на основе точности и четкости с прямым и четким подходом в общении. Чтобы работать с ними, используйте детали и конкретные инструкции, ставьте задачи, которые требуют точного выполнения, предоставляйте мотивацию и возможности для роста, развивайте навыки лидерства и избегайте возможных конфликтов.',
}


export const ESFJ = {
    title1: 'Описание типа личности:',
    text1: 'Это тип личности с эмоциональным и социальным подходом к работе. \
Они могут быть ценным активом для компаний, занимающихся социальными услугами, \
продажами, маркетингом и другими областями, которые требуют внимания к клиентам \
и хорошим коммуникативным навыкам.',

    title2: 'Сильные стороны:',
    text2: 'Обычно обладают высоким уровнем эмоциональной и социальной интеллектуальности. \
Они предпочитают работать в команде и могут быть отличными командными игроками. \
Могут также быть отличными обслуживающими работниками, которые способны отзываться \
на нужды клиентов и хорошо ориентированы в социальных взаимоотношениях.',

    title3: 'Слабые стороны:',
    text3: 'Могут быть склонны к перфекционизму и излишней заботе о других людях. \
Иногда они могут забывать о своих собственных потребностях и занятости. \
Также могут страдать от боязни конфликтов и избегать принятия решений, \
которые могут привести к потенциальному конфликту.',

    title4: 'Подходящие профессии:',
    text4: 'Могут быть ценным активом в областях, \
таких как социальные услуги, продажи, маркетинг, образование, здравоохранение, \
гостеприимство и другие области, которые требуют хороших коммуникативных навыков и внимания к клиентам.',

    title5: 'Как работать с представителем данного типа личности:',
    text5: '- Быть дружелюбным, вежливым и поддерживать теплые отношения.\n\
- Предоставить возможность для общения с коллегами и знакомства.\n\
- Поддерживать уважительную и доброжелательную атмосферу в офисе.\n\
Обычно являются очень дружелюбными и межличностными людьми, которые ценят гармонию и уважительное отношение на рабочем месте. Лучше всего работать с ними через открытое общение, обеспечивать им внимание и поддержку, а также уважение и чувствительность к их нуждам. Работодатель должен показать, что он оценивает их вклад в работу и готов поддерживать их, если они нуждаются в помощи.',

    title6: 'Как ставить задачи:',
    text6: '- Быть четким и понятным в описании задач и ожиданий от работника.\n\
- Дать возможность работать с людьми и используйте их хорошие коммуникативные навыки при постановке задач.\n\
- Позволять работать в коллективе и управлять социальными взаимодействиями.\n\
Они обычно предпочитают работу, которая не требует слишком сложных задач и является более привлекательной в социальном отношении. Для того, чтобы ставить задачи наиболее эффективным способом, необходимо объяснить им их значение для работы и их раскрытие, а также учитывать поддерживающую их активность на работе. Используйте четкие инструкции и более глубокое обсуждение работ, чтобы они могли сосредоточиться на выполнении задач.',

    title7: 'Чем мотивировать:',
    text7: '- Отмечать достижения работников и давать положительную обратную связь.\n\
- Предоставлять возможность помогать другим людям и влиять на их жизнь.\n\
- Создавать командный дух и поддерживать связи между работниками.\n\
Обычно лучше работают, когда чувствуют, что их работа имеет высокую ценность. Лучше всего мотивировать их через оказание личной поддержки и поощрения их социальных активностей. Проявляйте уважение и заботу, дайте им понять, как их работа важна и полезна для компании, а также оцените их вклад.',

    title8: 'Как решать проблемы и избегать конфликтов:',
    text8: '- Давать возможность высказывать свои мысли и чувства.\n\
- Предлагать альтернативные решения проблем и учитывать их мнение.\n\
- Работать с конфликтами и обеспечивать чувство безопасности для всех работников.\n\
Лучше всего работают в гармоничной атмосфере, поэтому конфликты могут развиваться, когда они чувствуют, что ситуация становится неприятной или напряженной. Лучший способ решить проблемы и избежать конфликтов - это говорить открыто и честно, быть чуткими к их ощущениям и ситуации, а также определить общие интересы и цели для минимизации разногласий.',

    title9: 'Как развивать лидерские способности и управлять командой:',
    text9: '- Поощрять их управлять людьми и работать на благо всех.\n\
- Предоставить групповые задачи и проекты, чтобы они могли использовать свои лидерские способности.\n\
- Создавать планы развития, которые помогут им развиваться в роли лидера.\n\
Обычно лучше всего работают в команде или менее формальной структуре их руководства. Для того, чтобы развивать у них лидерские способности, необходимо подмечать их признаки координированности и свойственной управляющей силы, а также создавать условия, которые позволяют им проявлять свое руководство. Дайте им возможность принимать решения и принимать лидерские роли, а также обучайте их навыкам руководящих способностей.\n\
\n\
В целом, работа с представителем этого типа личности может быть построена на основе эмпатии и социальных навыков с прямым и точным подходом в общении. Чтобы работать с ними, используйте ясные и понятные инструкции по ставке задач, предоставляйте поддержку и мотивацию, решаете проблемы и избегаете конфликтов и помогайте им развивать лидерские способности.',
}


export const ENFJ = {
    title1: 'Описание типа личности:',
    text1: 'Это тип личности, который обладает высоким уровнем эмоциональной \
и социальной интеллектуальности. Они могут быть ценным активом для компаний, \
которые занимаются маркетингом, рекламой, управлением ресурсами человеческих кадров, \
образованием и другими областями, которые требуют лидерства, коммуникации и умения вести переговоры.',

    title2: 'Сильные стороны:',
    text2: 'Обладают высоким уровнем эмпатии, \
они легко устанавливают контакт с другими людьми и обладают \
способностью мотивировать и организовывать их. \
Они ориентированы на результаты и приоритет ставят на благополучие команды и клиентов. \
Также обладают высоким уровнем социального интеллекта, \
что делает их способными решать сложные социальные проблемы \
и организовывать эффективное взаимодействие во время коллективных проектов и совместных дел.',

    title3: 'Слабые стороны:',
    text3: 'Могут быть склонны к излишней заботе о своих сотрудниках и клиентах, \
что может привести к выгоранию и изматыванию. Они могут также страдать от перфекционизма, \
который может замедлять их работу. Могут бояться конфликтов, \
что может привести к избеганию принятия решений, необходимых для успешного завершения задачи.',

    title4: 'Подходящие профессии:',
    text4: 'Могут проявить себя в профессиях, \
связанных с управлением персоналом, маркетингом, образованием, рекламой, \
психологией и других областях, где они смогут использовать \
свои лидерские и организационные способности.',

    title5: 'Как работать с представителем данного типа личности:',
    text5: '- Быть дружелюбным, теплым и поддерживать эмоциональную связь.\n\
- Оценить сильные стороны в области управления и мотивации.\n\
- Позволить работать в команде и принимать участие в общении.\n\
Они обычно открыты для общения и чувствуют себя комфортно в коллективе. Лучший способ работать с ними - поощрение активного участия и развития индивидуальных способностей, а также обеспечение возможности дать свой вклад в общие цели. Работодатель должен регулярно коммуницировать, узнавать их мнение, стремления и предпочтения, а также стараться принимать их адекватно.',

    title6: 'Как ставить задачи:',
    text6: '- Предоставлять возможность работать с людьми и использовать их хорошие коммуникативные навыки.\n\
- Давать четкие указания по выполнению задачи и мотивировать ознакомиться с результатами.\n\
- Показывать, какие преимущества может получить компания в результате выполнения задачи.\n\
Часто стремятся к работе, в которой они могут иметь общественное влияние, поэтому важно ставить задачи, которые затрагивают значимые области бизнеса. Работодателю следует поощрять развитие их креативности и предоставлять новые проекты, чтобы они могли проявить свои уникальные таланты.',

    title7: 'Чем мотивировать:',
    text7: '- Предоставлять возможность управлять ситуациями и продвигать свою точку зрения.\n\
- Признавать их заслуги и достижения.\n\
- Давать возможность работать в области, которая помогает другим людям и влиять на их жизнь.\n\
Они часто мотивируются не только заработной платой, но и внутренним удовлетворением от общественных достижений. Работодатель должен стимулировать их духовно-развивающуюся мотивацию, обеспечивать им возможности для открытого общения и признания их вклада в общие результаты.',

    title8: 'Как решать проблемы и избегать конфликтов:',
    text8: '- Давать возможность высказывать свои мысли и чувства.\n\
- Предлагать альтернативные решения проблем и учитывать их мнение.\n\
- Решать конфликты в тихой и спокойной обстановке.\n\
Стремятся к гармонии и уважают мнения других, однако, у них все так же есть свои личные убеждения и принципы. Лучший способ решения проблем и избегания конфликтов - это обсуждение проблемы, демонстрация уважения и сильного взаимодействия и активное предложение альтернативных решений.',

    title9: 'Как развивать лидерские способности и управлять командой:',
    text9: '- Задавать цели и направлять на руководящие посты.\n\
- Предоставлять возможности для управления группами и учета всех мнений.\n\
- Создавать планы развития, которые помогут развиваться в роли лидера.\n\
Это естественные лидеры, которые могут стать действительно большими перспективными кандидатами на руководящие позиции. Для того, чтобы развивать лидерские способности, на них можно предоставить такие возможности, как руководство командой, управление проектами и развитие новых бизнес направлений. Работодатель должен также способствовать обучению новым навыкам и наставничеству, \
чтобы они могли стать еще более навыченными руководителями.\n\
\n\
Как итог, работа с представителем данного типа личности может быть построена на эмпатии и социальном понимании с четким планом ставки задач, регулярным общением, компенсацией в виде внутренней мотивации и развития лидерских способностей. Учитывайте свойственную им чуткость к происходящим событиям в команде, а также стремление к общественной значимости в работе, и вы будете строить здоровые и продуктивные отношения с ними.',
}


export const ENTJ = {
    title1: 'Описание типа личности:',
    text1: 'Это тип личности, который обладает высокой энергией, \
лидерскими способностями и стремлением к достижению целей. \
Они могут быть ценными для компаний, \
которые нуждаются в уверенных и эффективных руководителях.',

    title2: 'Сильные стороны:',
    text2: 'Обладают развитыми лидерскими качествами, \
они легко организуют и управляют командами и эффективно решают проблемы. \
Они имеют высокий уровень аналитических навыков, что позволяет \
им участвовать в стратегических планированиях. \
Хорошо знают свои цели и работают на их достижение, \
они умеют работать в условиях стресса и неутомимо продолжают двигаться вперед.',

    title3: 'Слабые стороны:',
    text3: 'Могут быть чрезмерно критичными \
и иметь высокие стандарты как для себя, так и для других. \
Они могут быть властными и высказывать свою точку зрения настойчиво, \
что может приводить к конфликтам в рабочей команде. \
Также могут быть неуверенными в отношении ситуаций, \
которые не имеют строгих правил или градаций.',

    title4: 'Подходящие профессии:',
    text4: 'Могут проявить себя в профессиях, \
связанных с управлением, правом, финансами, наукоемких отраслях, \
связанных с технологиями и инженерией, а также в маркетинге и рекламе.',

    title5: 'Как работать с представителем данного типа личности:',
    text5: '- Быть прямолинейным, честным и эффективным в управлении.\n\
- Оценить сильные стороны в области лидерства и стратегического планирования.\n\
- Не бояться конфронтации и уметь рационально дискутировать.\n\
Часто являются доминирующими в лидерских ролях и обычно убедительны в выражении своих идей. Работодателю нужно дать им четкие и ясные инструкции, но также оставлять свободу в принятии решений. Важно создавать рабочую атмосферу, где руководитель и его команда располагаются на равных условиях, и они имеют возможность проявить свою лидерскую природу.',

    title6: 'Как ставить задачи:',
    text6: '- Предоставлять возможность работать в области лидерства и принимать стратегические решения.\n\
- Давать четкие и конкретные требования и контролировать выполнение задач.\n\
- Показывать, какие преимущества может получить компания в результате выполнения задачи.\n\
Обычно не увлекаются рутиной и в меньшей степени мотивируются этим. Лучший способ ставить задачи - это формулирование конкретных целей, установление временных рамок и дать им возможность проявить свою инновационную сторону. Работодатель должен поощрять мнение и творческие предложения, так как они обычно прекрасно осознают целесообразность тех или иных решений.',

    title7: 'Чем мотивировать:',
    text7: '- Предоставлять возможность управления процессами и реализации идей.\n\
- Признавать заслуги и достижения, давать возможность продвигаться по карьерной лестнице.\n\
- Расширять их сферу влияния, давая им возможность управлять более крупными проектами.\n\
Могут стать более мотивированными, когда им предоставляются новые руководящие задачи или когда они видят результаты своих достижений. Работодатель может помочь им в осуществлении их целей, предоставляя возможности для выступления на публичных мероприятиях или признавая усердность в профессиональной деятельности.',

    title8: 'Как решать проблемы и избегать конфликтов:',
    text8: '- Быть прямолинейным и предельно честным, ясно выражать свою позицию.\n\
- Включать в процесс принятия решений.\n\
- Избегать мелочных деталей, сосредоточившись на конечной цели.\n\
Обычно являются решительными и быстрыми в принятии решений. Однако, важно быть чуткими к мнениям других и не отрицать их взгляды, чтобы избежать обострения конфликта. Работодатель должен поддерживать атмосферу взаимодействия и обеспечивать многогранное обсуждение разных мнений и идей.',

    title9: 'Как развивать лидерские способности и управлять командой:',
    text9: '- Предоставлять возможности управлять группами и принимать ответственность за коллектив.\n\
- Обеспечивать достаточный уровень автономности и ориентированности на наибольшую эффективность работы.\n\
- Создавать планы развития, которые помогут развить способности по улучшению работы команды и управлению проектами.\n\
Это естественные лидеры, которые могут стать ценным кандидатом для лидерства в команде. Для того, чтобы развивать лидерские способности, разработка и предоставление сложных и комплексных проектов, наставничество и обучение, приватные консультации и менторинг - \
все это способствует формированию и расширению лидерских качеств.\n\
\n\
Как итог, работа с представителем данного типа личности может быть построена на доверии, четком планировании, возможности проявления лидерских качеств и стимулирования мотивации на достижение предлагаемых целей. Работодатель должен обеспечить удовлетворение начальных требований и необходимых условий, а они станут надежными и продуктивными исполнителями.',
}


